[{"pk": 13, "model": "registrationApp.houseadvisor", "fields": {"user_permissions": [], "favoriteColor": "", "groups": [3]}}, {"pk": 1, "model": "registrationApp.house", "fields": {"houseAdvisorTwoID": null, "roomNumber": 609, "houseAdvisorOneID": 13}}, {"pk": 1, "model": "registrationApp.parent", "fields": {"parentFirstName": "par1fn", "parentEmail": "darshandesai17@gmail.com", "parentPhoneNumber": 1020034, "parentLastName": "par1ln"}}, {"pk": 1, "model": "registrationApp.parentstudent", "fields": {"parentOneID": 1, "parentTwoID": null}}, {"pk": 14, "model": "registrationApp.student", "fields": {"activation_key": "", "houseID": 1, "parentStudentID": 1, "advisor2NoteRead": false, "advisor1Note": "This is a terrible schedule!", "advisorApproval": false, "graduationYear": 2013, "parentNoteRead": false, "submit": false, "groups": [1], "user_permissions": [], "advisor2Note": "", "advisor1NoteRead": true, "parentNote": "", "parentApproval": false}}, {"pk": 1, "model": "registrationApp.departmentchair", "fields": {"user_permissions": [], "favoriteColor": "blue", "groups": []}}, {"pk": 2, "model": "registrationApp.departmentchair", "fields": {"user_permissions": [], "favoriteColor": "blue", "groups": [2]}}, {"pk": 3, "model": "registrationApp.departmentchair", "fields": {"user_permissions": [], "favoriteColor": "blue", "groups": [2]}}, {"pk": 4, "model": "registrationApp.departmentchair", "fields": {"user_permissions": [], "favoriteColor": "blue", "groups": [2]}}, {"pk": 5, "model": "registrationApp.departmentchair", "fields": {"user_permissions": [], "favoriteColor": "blue", "groups": [2]}}, {"pk": 6, "model": "registrationApp.departmentchair", "fields": {"user_permissions": [], "favoriteColor": "blue", "groups": [2]}}, {"pk": 7, "model": "registrationApp.departmentchair", "fields": {"user_permissions": [], "favoriteColor": "blue", "groups": [2]}}, {"pk": 8, "model": "registrationApp.departmentchair", "fields": {"user_permissions": [], "favoriteColor": "blue", "groups": [2]}}, {"pk": 9, "model": "registrationApp.departmentchair", "fields": {"user_permissions": [], "favoriteColor": "blue", "groups": [2]}}, {"pk": 10, "model": "registrationApp.departmentchair", "fields": {"user_permissions": [], "favoriteColor": "blue", "groups": [2]}}, {"pk": 11, "model": "registrationApp.departmentchair", "fields": {"user_permissions": [], "favoriteColor": "blue", "groups": [2]}}, {"pk": 1, "model": "registrationApp.discipline", "fields": {"discipline": "Science", "departmentChair": 2}}, {"pk": 2, "model": "registrationApp.discipline", "fields": {"discipline": "English", "departmentChair": 3}}, {"pk": 3, "model": "registrationApp.discipline", "fields": {"discipline": "Language", "departmentChair": 4}}, {"pk": 4, "model": "registrationApp.discipline", "fields": {"discipline": "Math", "departmentChair": 5}}, {"pk": 5, "model": "registrationApp.discipline", "fields": {"discipline": "History", "departmentChair": 6}}, {"pk": 6, "model": "registrationApp.discipline", "fields": {"discipline": "Computer-Science", "departmentChair": 7}}, {"pk": 7, "model": "registrationApp.discipline", "fields": {"discipline": "PE", "departmentChair": 8}}, {"pk": 8, "model": "registrationApp.discipline", "fields": {"discipline": "Dance", "departmentChair": 9}}, {"pk": 9, "model": "registrationApp.discipline", "fields": {"discipline": "Music", "departmentChair": 10}}, {"pk": 10, "model": "registrationApp.discipline", "fields": {"discipline": "Art", "departmentChair": 11}}, {"pk": 11, "model": "registrationApp.discipline", "fields": {"discipline": "Misc", "departmentChair": 1}}, {"pk": 3, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "Calculus 2A is an HONORS COURSE designed for the student who has mastered the material ofPrecalculus Mathematics.  It will primarily cover the Calculus 1A curriculum in the first semester and then proceed to explore the generalized limit theorems of Cauchy and LHospital, Taylors Theorem, general convergence of infinite series and Taylors series with remainder. Topics will also include some of the calculus of parametric representations.  It is equivalent to the first two semesters of College Calculus. (This course would prepare a student for the BC examination of the AP curriculum, if the student opted to take it.)department", "gradesOffered": "12", "courseName": "Calculus 2’A’", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Strong completion of Precalculus IIA, qualifying exam, and placement by the math "}}, {"pk": 6, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "Calculus 1A is an HONORS COURSE designed for the student who has mastered the basic material of secondary mathematics. This course is roughly equivalent to a first semester college calculus course. The course is a blend of both application and theory and includes some proofs of theorems standard to a beginning calculus curriculum. (This course would prepare a student for the AB examination of the AP curriculum, if the student opted to take it.)math department", "gradesOffered": "12", "courseName": "Calculus 1’A’", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Strong completion of Precalculus or Precalculus IA, qualifying exam, and placement by the "}}, {"pk": 8, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This course is designed for the advanced student who has demonstrated a certain ease and facility with mathematical thinking as determined by individual evaluation.  It is an HONORS COURSE and presents the topics of transformational geometry in a rigorous manner. Topics include: the four isometries in theplane and their role in the theory of congruence; geometry of the circle; the plane shear as an area preserving mapping and its application to orthogonal projections; the similarity transformation and an overall look at the concepts of co linearity and concurrency.  The course concludes with a full introduction to solid geometry.department", "gradesOffered": "10", "courseName": "Transformational Geometry ‘A’", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Successful completion of Level I Math, qualifying exam, and placement by the math "}}, {"pk": 9, "model": "registrationApp.course", "fields": {"courseCredit": "Full year course, 1 credit", "courseDescription": "This course covers logic, Euclidean plane geometry, analytic geometry, measurement geometry (length, area, and volume of traditional shapes), and trigonometry.  Past algebra will be integrated.", "gradesOffered": "10", "courseName": "Geometry", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Level I Math"}}, {"pk": 11, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "This course will take a more in depth and sophisticated approach to topics traditionally covered inGeometry (9-0). In particular, it will cover logic, Euclidean plane geometry, analytic geometry, length, area, volume, and an introduction to right triangle trigonometry. If time allows, additional topics may becovered. (These topics may vary from year to year.) Past algebra will be integrated.  It is an honors levelcourse.", "gradesOffered": "10", "courseName": "Euclidean Geometry ‘A’", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 16, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This course is designed for the student who has familiarity with linear and quadratic algebra, a strong number sense, and a proven work ethic prior to entering the high school program.  The course includes a treatment of polynomial algebra and the theory of equations; rational and irrational expressions (including complex numbers); linear, quadratic, and polynomial expressions (equations, inequalities, systems, and functions); conic sections, logarithms and exponential functions. Throughout the course, the students are required to write proofs.  It is an honors level course.placement by the Math department", "gradesOffered": "10", "courseName": "Algebra 2 Honors", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Successful completion of Algebra I, demonstration of ability on a qualifying exam, and "}}, {"pk": 18, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This course is designed for the student who has successfully completed an Algebra I course. It is designed to complete the treatment of algebra by examining polynomial algebra, linear, quadratic, rational and radical expressions and relationships (equations, inequalities, systems and functions), and introduce logarithm and exponential functions.placement by the Math department", "gradesOffered": "10", "courseName": "Algebra 2", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Successful completion of Algebra I, demonstration of ability on a qualifying exam, and "}}, {"pk": 20, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "This course is designed for the student who has had some exposure to Algebra prior to entering the high school math program.  Students receive a thorough review of the basic laws of algebra, the real numbersystem, and fundamental operations on algebraic expressions. This course also includes working with quadratics, linear inequalities, rational expressions, radicals, graphing and functions.Placement by the math department. This is a beginning Algebra course. ", "gradesOffered": "10", "courseName": "Algebra 1/2", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 50, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "Precalculus 2A provides the theoretical foundation required for Calculus 2A andPhysics. Material is presented in a rigorous manner. The first semester covers vectors, polynomial and rational functions, sequences and series, induction, the binomial theorem, combinations and permutations, and parametric equations. The second semester covers exponential and logarithmic functions, trigonometry, polar coordinates,  conic sections and DeMoivres theorem.  Introductory differential calculus topics will be integrated throughout the year. PC2A is an honors level course.", "gradesOffered": "11", "courseName": " Precalculus 2 ‘A’", "preapprovalRequired": true, "rankType": null, "corequisite": "Co-requisite: Physics AX ", "prerequisite": "Prerequisite: Strong completion of Level II Math, and approval by the Math and Science departments"}}, {"pk": 51, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This is a demanding course, preparing students for Calculus 1A.  It provides in-depth theory of functions and their inverses; and examines the specific cases of polynomial, exponential, logarithmic, trigonometryand rational functions. Limit symbolism is introduced. Entering students should be secure in Algebra IIand right triangle trigonometry. It is an honors level course.department", "gradesOffered": "11", "courseName": " Precalculus 1 ‘A’", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Strong completion of Level II Math, qualifying exam, and placement by the Math "}}, {"pk": 52, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "This course covers many topics from traditional precalculus. The curriculum includes forming a solid foundation of the properties and notation of functions. Specific topics include the study of polynomial and rational, exponential and logarithmic, and trigonometric functions. Additional topics include sequences and series, probability, and the binomial theorem. Students will be introduced to limits.", "gradesOffered": "11", "courseName": " Precalculus", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Level II Math"}}, {"pk": 55, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits", "courseDescription": "This course extends the topics introduced in the Computer Science I course. The major emphasis of this course is advanced programming methodology, algorithms, and using fundamental data structures. Topics include robotics, text manipulation numerical algorithms, searching techniques, disk files, arrays and multidimensional tables. Object-oriented programming and architecture is emphasized. Current computer science literature is used in class. If a students plans to take the AP Computer Science exam, this course applies. Assignments in this course are intended to prepare the student for the computer science team.", "gradesOffered": "9,10,11,12", "courseName": "Computer Science 2", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 57, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credit", "courseDescription": "This course is a broad introduction to the field of computer science, covering topics from applied sciences, social sciences, and mathematics. The course covers a basic understanding of computer science theory; a study of algorithms and other problem solving techniques; current computer science research topics; an introduction to digital electronics; robotics; network access methods; and the development of computers in todays society.  Students will learn to use the Java programming language and to use well- known computer problem solving and web page tools. This course is useful to all students: those who will study or work with computers in college, those who desire a general knowledge of computer science, or those who are interested in the application of computer science to other fields.", "gradesOffered": "9,10,11,12", "courseName": "Computer Science 1", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 67, "model": "registrationApp.course", "fields": {"courseCredit": "Fall Semester Course, 0.50 credits", "courseDescription": "This course is designed as the first of two sequential semester courses intended to introduce the student to the basic concepts of Calculus.  It is an intuitive exploration of the topics and less formal than the honors courses.  In the first semester, the course focuses on differential calculus. Topics include: geometric interpretations of the derivative; techniques of differentiation for polynomial, rational and algebraic functions; and applications of the derivative to curve sketching, optimization and related rate problems.", "gradesOffered": "12", "courseName": "Differential Calculus", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Strong completion in Precalculus, qualifying exam, and placement by the math department"}}, {"pk": 68, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This course is designed as the second of two sequential semester courses intended to introduce the student to the basic concepts of Calculus.  It is an intuitive exploration of the topics and less formal than the honors courses.  In the second semester the course focuses on integral calculus. Topics include:geometric interpretations of the integral; techniques of integration as well as working with the indefinite integral; and application of the integral to simple area and volume problems (with the assistance ofcomputer graphing programs).department", "gradesOffered": "12", "courseName": "Integral Calculus", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Completion of Differential Calculus, qualifying exam, and placement by the math "}}, {"pk": 71, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "This course covers descriptive and inferential concepts. It will include extensive work in probability theory and applying this theory to an extensive array of hypothesis tests and construction of confidenceintervals. There will be emphasis placed on analysis of the results. The course covers the materialnecessary for the AP exam, as well as, supplemental topics. Department permission is required. ", "gradesOffered": "12", "courseName": "Statistics", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 74, "model": "registrationApp.course", "fields": {"courseCredit": "Spring Semester Course, 0.25 credits", "courseDescription": "“Colorless green ideas sleep furiously.\"How can we understand that sentence, famously uttered by Noam Chomsky, even though it makes no sense? Language is central to the study of the human mind. This course will be an exploration of linguistics, the scientific study of language structure, history, and use. We will use computers to look at topics including notions of \"grammar,\" the structure of sounds, words, sentences, and meanings, language in culture and society, language change over time, language acquisition and processing, and comparison with non-human communication systems. Students will also participate in the North American Computational Linguistics Olympiad.", "gradesOffered": "9,10,11,12", "courseName": "Computational Linguistics", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 76, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This course is an interdisciplinary course between computer science, physics, and mathematics. Student assignments will reflect concepts from all three disciplines. Students participate on the computer science team.  If a students plans to take the AP Computer Science exam, this course applies.", "gradesOffered": "9,10,11,12", "courseName": "Advanced Computer Science 2 ‘A’: Math/Physics", "preapprovalRequired": true, "rankType": null, "corequisite": "Co-requisites:  Pre-Calc 2A and Physics A ", "prerequisite": "Prerequisite: Computer Science I, Advanced Computer Science 1"}}, {"pk": 80, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.5 credits", "courseDescription": "This is an independent study course.  A student will design an individual study plan to complete this course.  Students participate on the computer science team and regional competitions.Permission of the instructor required.", "gradesOffered": "9,10,11,12", "courseName": " Advanced Computer Science Senior Project", "preapprovalRequired": true, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 82, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This honors level course is an interdisciplinary offering between computer science, physics, and mathematics. Student assignments will reflect concepts from all three disciplines including projectilemotion; orbitals; strings; particles; matrices and area below a curve. Simple graphics will be included aspart of the course. Dedicated time outside of the classroom is expected. Students participate on the computer science team.  If a students plans to take the AP Computer Science exam, this course applies.", "gradesOffered": "9,10,11,12", "courseName": " Advanced Computer Science 2‘A’: Math/Physics", "preapprovalRequired": true, "rankType": null, "corequisite": "Co-requisites:  Pre-Calc 2A and Physics A ", "prerequisite": "Prerequisite: Computer Science 1 and 2"}}, {"pk": 90, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Advanced Math Seminar", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 91, "model": "registrationApp.course", "fields": {"courseCredit": "Full year course, 0.50 credits, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Math Team", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 109, "model": "registrationApp.course", "fields": {"courseCredit": "Full year course, 1 credit", "courseDescription": "Paris is an especially privileged space--described, represented, concretized, abstracted, mythologized for two millenia. It is perhaps the the most romantic and romanticized capital in the world. Paris is the City of Light and also the setting of the noir, the city of dreams and ambitions attained or disappointed, ofhistory, of modernity, of nostalgia for what was and also for what never was. The course will explore the evocation of real and idealized Parisian topography in literary, historical and cultural texts and itsrepresentation in painting, drawing, photography, and film, examining traces of the many dualities,dialectics and paradoxes that comprise \"Paris.\" It is designed to expose students to a wide variety of texts and images from different periods, places, and genres, teaching them to read and to analyze words andimages with acuity and skill and to write about and discuss them with increasing competence andconfidence.", "gradesOffered": "9,10,11,12", "courseName": " Paris: Text and Image", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 111, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "French 4 ‘A’", "preapprovalRequired": true, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 112, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "French 4", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 117, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "French 3 ‘A’", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 118, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "French 3", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 127, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "French 2", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 134, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "French 1", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 139, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "The Conversation and Composition course aims to strengthen speaking and writing skills in Spanish. We begin the year with a discussion of potentially polemical topics and questions pertaining to each.Students choose discussion topics and the order in which they are debated.  In the past, these themes have included abortion, alcohol and drug policies, censorship, violence, affirmative action, and current issues.In–class discussions and debates typically involve initial free discussion, identification of key questions, some research and a paper. Writing may take a creative approach in addition to the formal paper (a flyer,an editorial to the NYT, a letter). Students are expected to come out of each unit better informed about the different sides of each issue.  Reading and writing poetry, listening to and discussing popular music are additional means for students to expand their breadth of expression and culture in Spanish.", "gradesOffered": "9,10,11,12", "courseName": "Spanish Conversation and Composition", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Spanish Level 4 and departmental permission"}}, {"pk": 141, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Spanish 4", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 144, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Spanish 3", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 147, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Spanish 2", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 153, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Spanish 1", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 154, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "This course offers students the possibility of reading literary works in Spanish and thus gaining further understanding of the culture through fiction and poetry written by, and for, Spanish-speakers.  Students will have the opportunity to improve their reading, writing and oral skills through class discussions, papers, in-class essays and commentaries on our blog.  The class is conducted in a relaxed, seminar-like environment so students learn independently, and from each other by sharing their thoughts and analysis, especially on the blog.  Our reading list consists of short stories, poetry and short fiction by major 20th century writers from Spain and Latin America.  By the end of the year students knowledge of Spanish language, history, literature, and art, will have expanded greatly.  The real pleasure of this class is the potential for self-discovery, and the penetration of a culture through its literature and experience.", "gradesOffered": "9,10,11,12", "courseName": "Introduction to Literature in Spanish.", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite:  one year of elective and departmental permission. "}}, {"pk": 162, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "We explore literary and artistic movements in 19th-century France.  Guy de Maupassants Pierre et Jean helps establish what was meant at the time by the terms naturalism and realism.  We read Gustave Flauberts Madame Bovary, in its entirety, George Sands Elle et lui, and then the poetry of twogenerations of poets.  In April, while reading Jean Renoirs biography of his father, painter Pierre-AugusteRenoir, students present multi-media portraits of French painters and composers and their works.  A visit to the Metropolitan museum will supplement an on-line art gallery and research materials in the library.", "gradesOffered": "9,10,11,12", "courseName": "19th Century Literature, Art, and Music A", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite:  Advanced French 4 or Departmental permission."}}, {"pk": 167, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "This course is designed to take students from an advanced intermediate level to an advanced level in French, where reading, discussing, and writing about complex texts becomes the comfortable norm.  We read autobiographical narratives and discuss films grounded in childhood experiences: texts and films include Agates et calots (Joseph Joffo); Monsieur Ibrahim et les fleurs du Coran (Eric-Emmanuel Schmitt); LEnfant noir (Camara Laye); Bonjour Tristesse (Françoise Sagan);  Rêves de femmes:  Une Enfance au harem (Fatima Mernissi); Le Coeur à rire et à pleurer (Maryse Condé); Rue Deschambault (Gabrielle Roy); Ma Vie en Rose (dir. Alain Berliner); Mina Tannenbaum (dir. Martine Dugowson); and LEffrontée (dir. Claude Miller). These twentieth-century authors and directors discuss childhood and young adulthood in familial and cultural contexts provided by France, Morocco, Guinea Bissau, Guadeloupe, and Canada. Students explore through class discussion and researched exposés the ways authors process their perceptions of family dynamics, social cultures provided by home, school, and neighborhoods, and larger political questions that filter into their lives as they near adulthood. The Barrons AP French Language book, relevés stylistiques, and vocabulary lists help those students who want to review for the AP French Language exam; in addition, students learn technical terms and mechanics for literary analysis and persuasive argumentation in French.", "gradesOffered": "9,10,11,12", "courseName": "French Introduction to Honors – Autobiographies in French-Speaking Countries ‘A’", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Advanced French 4 or Departmental permission. "}}, {"pk": 172, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "This class is a survey of literature in Spanish. We read poetry and prose from Spanish and Latin American authors such as Federico García Lorca, poet, playwright, musician and visual artist; Miguel de Unamuno, cornerstone of Spanish modernity; Colombian Nobel Laureate Gabriel García Márquez, Argentinean masters Jorge Luis Borges and Julio Cortázar, and Chilean Roberto Bolaño and Pablo Neruda. Students have the opportunity to go deeply into the historical background, literary schools, in addition to the artistic and philosophical environment that permeate the works of these authors. Comparative analysis, creativity and serious commitment to research are of extreme importance. The seminar-like environment requires an ability to share knowledge of the material covered and capacity to undertake reading assignments on a daily basis. The real pleasure of this class is the potential for self- discovery that literature offers, and the possibility of penetrating a different culture through its letters in the original language, an experience that very few people have.  We read authentic, unabridged editions. Our students come out of this course with a broad vision of great works of Spanish Literature and cultures that produced them.", "gradesOffered": "9,10,11,12", "courseName": "Modern Hispanic Literature ‘A’", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Advanced Spanish Level 4 or one year of elective and departmental permission. "}}, {"pk": 173, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "This course is an exploration of Spanish and Latin American cinema through the viewing, analysis, and discussion of films from different countries and representative directors. Their historical and culturalcontexts will be studied in order to gain a better understanding of the Spanish-speaking world. Thecourse aims to broaden the knowledge of Spanish and Latin American cultures and offer students the opportunity to exercise the spoken and written language by engaging the general themes treated (the independent woman, destiny, betrayal, etc.).  Students will be expected to read and discuss selections on historical and socio-cultural material and do some research pertinent to the films.  They will be responsible for creating and presenting a project inspired by the course and their own interests.", "gradesOffered": "9,10,11,12", "courseName": "Hispanic Cinema", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite:  one year of elective and departmental permission. "}}, {"pk": 182, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Mandarin Chinese 6", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 187, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Mandarin Chinese 1", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 189, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Mandarin Chinese 2", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 190, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Mandarin Chinese 3", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 191, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Mandarin Chinese 4", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 202, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "Beginning study of vocabulary, grammar and translation. Text:  Athenaze by Lawall and Balme", "gradesOffered": "9,10,11,12", "courseName": "Greek 1", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 205, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "Students in this course will finish the basic curriculum of grammar and syntax and then reinforce this curriculum by translating substantive Latin stories into English. Next, students will translate Romanauthors whose lively and eloquent prose represent the wit, edge, and biting realities of the Roman Empireand its courtly urbanity. Together we will encounter Petronius’ satire Satyricon, Ovid’s playfulMetamorphoses, and many of Pliny’s highly stylized and courtly letters.The ongoing emphasis will be on development of translating skills, the identification of syntax and grammar, and the enlargement of vocabulary. In addition, students will do some Latin compositions to sharpen and consolidate their awareness and practice of grammar and syntax.", "gradesOffered": "9,10,11,12", "courseName": "Latin 3 – Selected Authors", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Latin 2"}}, {"pk": 206, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "Selections from In Verrem and the Catilinarians show students the rich oratorical devices of Ciceros style.  Selections from the letters of Pliny the Younger contrast his approach to governing with that of Verres.  Selections from Sallust’s Bellum Catilinae again present another perspective on the Catilinarian conspiracy.  Historical, socio-political and cultural backgrounds are important components of this course. Students also learn figures of speech and oratorical devices.", "gradesOffered": "9,10,11,12", "courseName": " Cicero", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 208, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "Continuation of Latin 1", "gradesOffered": "9,10,11,12", "courseName": "Latin 2", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 209, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "Beginning study of grammar, vocabulary, and translatingText: First Year Latin, Jenney, Scudder and Baade", "gradesOffered": "9,10,11,12", "courseName": "Latin 1", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 219, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "Students translate selections from Caesars De Bello Gallico.  Historiography and the role of Rome inGaul and Britain are important considerations.  Students read another source about Caesar such asSuetonius to study Caesar from another point of view. ", "gradesOffered": "9,10,11,12", "courseName": " Caesar", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 222, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "Continuation of Greek 1", "gradesOffered": "9,10,11,12", "courseName": "Greek 2", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 233, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "This course is a continuation of Greek 3 MS/HS. ", "gradesOffered": "9,10,11,12", "courseName": "Greek 4", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 235, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "Students translate selected passages from Books I, II, IV and the end of XII of the Aeneid. A wide range of discussions and assignments focus on literal and free translating, on the poetic meter, the major themes and the figurative language of epic verse, and on the socio-political reformation of the Augustan Age.", "gradesOffered": "9,10,11,12", "courseName": "Vergil", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 256, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "Conclusion of grammar and reading from the Anabasis Book", "gradesOffered": "9,10,11,12", "courseName": "Xenophon", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 260, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "Students read the poetry of Catullus and Horace.  Poems are read with attention paid to the themes poeticdevices, philosophies, historical background and metrical forms. The Greek influences on Catullus andHorace are examined as well as modern poetry which has been influenced by these authors.", "gradesOffered": "9,10,11,12", "courseName": "Latin Lyric Poetry A", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 270, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "This course is designed for those who wish to strengthen their skills in speaking, listening, reading and writing through a series of hands-on projects that combine guided research, comparative cultural analysisand creative production.  Students will develop TV and radio commercials for a chosen product, curate a21st century art exhibit, set up concerts and dance workshops, and organize a campaign to address relevant immigrant issues in NYC among other projects. This approach will allow students to acquire the tools toimmerse themselves in contemporary language use, enhancing their understanding of issues and currentevents and increasing language proficiency through discussions, presentations, and the use of technology.", "gradesOffered": "9,10,11,12", "courseName": "Projects: Practices and Products from Contemporary Hispanic Culture", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite:  Spanish Level 4 and departmental permission"}}, {"pk": 302, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This semester will focus on the macro or large scale view of the environment.  We will study ecosystems(including Central Park), human population growth, El Nino, the atmosphere, climate change and global warming.  Environmental policies and laws will also be an on-going theme throughout the semester. Class work will consist of small labs, hands-on activities, case studies, and discussions.Fall Semester Credit, 0.50 credits\tW. Hopkins", "gradesOffered": "12", "courseName": "Environmental Science", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: 2 years of science"}}, {"pk": 303, "model": "registrationApp.course", "fields": {"courseCredit": "Spring Semester Course, 0.50 credits", "courseDescription": "This semester emphasizes the importance of renewable energy and the use of alternative methods to nonrenewable energy resources. We will take an in-depth look at how we use water and the effects it hasboth locally and worldwide.  We will also focus on solar, wind, hydroelectric, geothermal, biomass, and nuclear power. We will also discuss environmental ethics and our role as citizens of the world.  Classwork will consist of small labs, hands-on activities, case studies, and discussions.", "gradesOffered": "12", "courseName": "Environmental Science - Environmental Resources", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: 2 years of science\tW. Hopkins"}}, {"pk": 305, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "A challenging college level course designed to expand upon the concepts introduced in the introductory course and to develop higher level analytical skills in problem solving and laboratory work.  Quantummechanics, molecular bonding theories, thermodynamics, kinetics, and equilibrium systems are some ofthe topics that will be studied in significantly more depth. Laboratory work is a major focus throughout the year. Students will be required to use lab time outside of class to finish some experiments. Studentsmay be required to complete some preparatory work prior to the start of the school year.Permission of the instructor required.", "gradesOffered": "11", "courseName": "Advanced Chemistry ‘A’", "preapprovalRequired": true, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: A- or better in Chemistry or B+ or better in Chemistry ‘A’"}}, {"pk": 306, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, approval required", "courseDescription": "As in Chemistry but in greater depth and with more emphasis on analytical reasoning and extensive quantitative problem-solving.", "gradesOffered": "10", "courseName": "Chemistry A", "preapprovalRequired": true, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 307, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "This introductory survey course provides students with a fundamental understanding of chemistry and its applications in everyday life. Topics covered include Atomic Theory, the Periodic Table, stoichiometry,Thermodynamics, acids and bases, and equilibrium.  Wet experimentation is a prominent component. Technology is often used for data collection and analysis, and for computer simulations that enrichlearning.", "gradesOffered": "10", "courseName": "Chemistry", "preapprovalRequired": true, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Biology and Algebra I "}}, {"pk": 308, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "This is an introductory survey course that includes the study of mechanics and the fundamental laws of gravity, electrostatics, and magnetism.  It is conceptual in its nature and problems are solved using onlyfundamental math skills. The course develops an understanding of the concepts through demonstrations, questions, activities, computer-simulated physical situations, computer aided experiments and projects. The mathematical relationships of physics are used primarily to guide thinking in answering why or what will happen in a given physical situation. An emphasis of the course is on how physics relates to everyday life. The final assignment in the spring integrates applications influenced by student interest.  Past topics have included the physics of music, the physics of dance, and pseudo-science.", "gradesOffered": "11", "courseName": "Physics", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 310, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This semester is devoted to our immediate astronomical neighborhood. We study the basic motions of celestial objects, the history of astronomy, extrasolar planets, and the possibility of extraterrestrial life.  Students will gaina deeper understanding of astronomy through projects, hands-on activities, and computerized sky simulations.Evening observing will take place a handful of times during the semester.Fall Semester Credit, 0.5 credit\tJ. Francischelli", "gradesOffered": "12", "courseName": "Astronomy", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: 2 years of science"}}, {"pk": 311, "model": "registrationApp.course", "fields": {"courseCredit": "Spring Semester Course, 0.50 credits", "courseDescription": "This semester emphasizes stars, galaxies and cosmology.  We will learn how to classify stars and study their evolutionary cycle, including black holes and neutron stars. We will look at different types ofgalaxies and how they are changing over time.  And we will discuss the expansion of the Universe and theBig Bang. Evening observing will take place a handful of times during the semester.", "gradesOffered": "12", "courseName": "Astronomy: The Universe", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: 2 years of science\tJ. Francischelli"}}, {"pk": 312, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "Advanced Biology starts as a college level human physiology course that provides a detailed study of how the various body systems, such as the nervous, immune, circulatory and endocrine, operate at abiochemical, cellular and macroscopic level. Besides studying body systems, an emphasis is placed on investigating DNA and modern genetics, genetic engineering, and molecular biology, The roles played bydiet, stress, exercise, and various medical technologies and medicines in extending or shortening our lives will be included. The curriculum then proceeds into studies of the many aspects of evolution from classical and modern perspectives, classical genetics, and embryology. This course constantly utilizesinformation and important concepts studied in General Biology and Chemistry.Experimental work includes histological studies, bacterial DNA transformation, amino acid analysis/chromatography, enzyme-substrate titration studies, WBC differentials, photosynthesis/spectrophotometry and a polymerase chain reaction/electrophoresis, to name a few. We also dissect the heart, brain and kidney. Each student is required to write a research paper during the first semester. A field trip to the Cold Spring Harbor DNA Laboratory to perform a DNA Restriction Analysis is included.** Students will be partially prepared to take the AP Biology exam in May.  Additional materials will be given to students who wish to take the exam.  They will need to review on their own the information not discussed in class and attend a few review sessions before the exam.Permission of the instructor required.", "gradesOffered": "11", "courseName": "Advanced Biology ‘A’", "preapprovalRequired": true, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Biology, Chemistry: a B or better in both."}}, {"pk": 319, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This course is a two-semester sequence. The fall semester, Advanced Physics I, will have a curriculum that includes the content required for the AP Physics C exam in Mechanics.  In the spring semester,Advanced Physics II will develop further the concepts and topics of the first semester.  It will also include fundamental topics in Electricity and Magnetism, though it may not include the required content for theAP Physics C exam in Electricity and Magnetism.  Examples of the systems to be encountered include: the gyroscope, the top, and oscillating systems of more than one body.  Physical laws are expanded upon through the use of advanced demonstrations, computer-simulated physical situations, computer-aidedexperiments, and projects. Because of the advanced nature of the course, the student must have a solid conceptual understanding of physics and have highly proficient mathematical skills.  Emphasis of thiscourse is on the application of physical laws to solve more realistic and complex physics problems.Co requisite: Calculus 2A", "gradesOffered": "12", "courseName": "Advanced Physics 2 ‘A’", "preapprovalRequired": true, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Physics 'A'. Permission of the instructor required. "}}, {"pk": 331, "model": "registrationApp.course", "fields": {"courseCredit": "Full year course, 1 credit\tJ. Francischelli", "courseDescription": "Advanced Topics in Physics is a full-year, mathematically rigorous, college-level course open to students who have taken physics in their junior year. Topics covered in the fall semester include fluid dynamics,rotations, wave motion, and thermodynamics.   In the spring semester, we discuss sound, light, optics,relativity, and quantum theory.  Students will also build upon their knowledge of classical mechanics, electricity and magnetism.  Experiments, demonstrations, computer simulations and projects will enhanceconceptual understanding of physical laws.  Problem-solving skills from algebra, geometry, and calculuswill be needed.Permission of the instructor required.", "gradesOffered": "12", "courseName": "Advanced Physics ‘1A’", "preapprovalRequired": true, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: A grade of A- or better in Physics or a grade of B+ or better in Physics ‘A’."}}, {"pk": 332, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This course is similar to regular Physics in content, but with a greater emphasis on the mathematical analysis of physical phenomena and a deeper treatment of most concepts.Students who have taken regular Physics are not eligible for Physics A ", "gradesOffered": "11", "courseName": "Physics ’A’", "preapprovalRequired": true, "rankType": null, "corequisite": "Co-requisite: Recommend: Precalculus 2’A’ for juniors, and Calculus 1’A’ or 2’A’ for seniors, OR ", "prerequisite": "Prerequisite: 2 years of science"}}, {"pk": 339, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit\tJ. Geller", "courseDescription": "This course is an introduction to human physiology. In the fall semester we explore the physiology of many organ systems and the nature of disease and nutrition.  In the spring semester we study reproductivephysiology and development, sexuality, sexually transmitted diseases, AIDS and substance abuse.Readings, discussions, short oral reports and individual research papers are features of each semester. In addition there is a project each semester. In the fall this project is a diet analysis; in the spring juniors willchoose a project while seniors leave for senior initiative.", "gradesOffered": "12", "courseName": "Human Physiology", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: 2 years of science"}}, {"pk": 347, "model": "registrationApp.course", "fields": {"courseCredit": "Spring Semester Course, 0.50 credits, approval required", "courseDescription": "A study of the anatomy of the five classes of vertebrates with appropriate dissections and related anatomical text readings. A large focus of the class will be the dissection of representative members of the vertebrate class.", "gradesOffered": "12", "courseName": "Comparative Anatomy of Vertebrates", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Biology and Chemistry"}}, {"pk": 350, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "Forensic Science has evolved into a broad field that includes document handwriting and fingerprint analysis, toxicology and many other areas. Most of the work done is designed fro the purposes of identification and/or comparison. The results of the various analyses are used to prove arguments in court. This course will study and employ a variety of techniques and analytical methods used in criminal investigations.  Activities and experiments are primary components of this course.Fall Semester, 0.50 credits\tN. Boyer", "gradesOffered": "12", "courseName": "Forensic Science", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisites: One year each of chemistry and biology"}}, {"pk": 407, "model": "registrationApp.course", "fields": {"courseCredit": "Fall Semester Course, 0.50 credits\tA. Glassman", "courseDescription": "From the 1830s through the early 1900s, Russian writers produced fiction of extraordinary emotional power. What was the source of this outpouring? Is it found in a tension between a romantic sense ofdestiny and a modernist sense of existential emptiness? What does it accomplish?The intricacy of writers attention to states of mind, relationships and social revolution will be explored through close reading of narrative texts. Students will also explore the philosophical, literary, and historical context in which the fiction was conceived. Readings will include such texts as Dostoevskys Crime and Punishment and Tolstoys Anna Karenina.", "gradesOffered": "12", "courseName": "Russian Fiction", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 414, "model": "registrationApp.course", "fields": {"courseCredit": "Fall Semester Course, 0.50 credits\tK. Luten", "courseDescription": "The thirty-seven plays that William Shakespeare wrote for his own company of actors from 1591 to 1613 have come to be recognized as some of the most remarkable literary and dramatic achievements of anyage or culture. We will focus not only on what makes Shakespeare’s work timeless, but also on thoseaspects of it that are not immediately accessible to modern readers and playgoers, and that nevertheless make his plays so distinctive.  We will consider these plays chiefly as theater, and our class discussions will be augmented by seeing the plays through videotape and possibly live performance.  Focusing on Shakespeare’s dramatization of evil, this year’s plays will be Titus Andronicus, Hamlet, King Lear, and The Tempest.", "gradesOffered": "12", "courseName": "Shakespeare", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 428, "model": "registrationApp.course", "fields": {"courseCredit": "Spring semester course, 0.50 credits\tW. Fisher", "courseDescription": "The notion that gender and sexuality are aspects of a person’s identity originated in the mid-nineteenth century, when, for example, the words “heterosexual” and “homosexual” were first coined.  Writers of novels, because one of their natural subjects is the relationship between the individual and society, have played an important role in describing or portraying people’s experience of sexuality and the social conditions that have shaped such experience.  In this course, we will be studying a selection of texts that take up the task of both articulating that experience and critiquing the structures of language and society that help shape that experience.Among many questions, we will consider: How is language used to define, or describe, gender and sexuality?  What are the distinctions between a male and female writer and male and female writing? How is sexual identity created and experienced?  Can identity be defined from within, or from without?What are the connections between gay, lesbian, and bisexual writers?  How does the novel, as an art form, portray the social and political conditions and movements that have impinged on sexuality in the last 100years? Works include writers such as: James Baldwin, Henry James, Audrey Lourde, Melvin Dixon,Randal Kenan, Helene Johnson, and Nella Larsen.", "gradesOffered": "12", "courseName": "Gender and Sexuality", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 437, "model": "registrationApp.course", "fields": {"courseCredit": "One Semester Course, 0.50 credits", "courseDescription": "Through a study of the elements of a poems composition and careful discussion of individual lyric and narrative poems in class, this course seeks to provide a method of analysis and to develop a capacity forappreciating poetic argument, language and insight. Readings are drawn from English and Americanpoetry from the Renaissance to the present day.Students write at regular intervals about poetry, and their work culminates in an independent project on a poet of their own choice.", "gradesOffered": "10", "courseName": "Introduction to Poetry (Fall)", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 438, "model": "registrationApp.course", "fields": {"courseCredit": "Fall Semester Course, 0.50 credits\tE. Lambert", "courseDescription": "In our modern world, to a degree unprecedented in earlier Western history, romantic love is seen as the all-important life-experience.  Yet the ideal is fraught with ambiguity and uncertainty: what do we meanby love? how can we make it last? how can we reconcile our need for union with our need for autonomy?We will read a number of works in various genres which address these questions. Texts will include either D. H. Lawrences  Sons and Lovers or Henry Jamess Portrait of a Lady, Vladimir NabokovsLolita, and stories by Raymond Carver.", "gradesOffered": "12", "courseName": "Masterpieces of Modern Love", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 446, "model": "registrationApp.course", "fields": {"courseCredit": "Fall Semester Course, 0.50 credits\tC. Leja", "courseDescription": "The nineteenth century is considered the heyday of the novel as a form, the period when the genre combined the greatest coherence with the most variety, the highest skill with the widest popularity. At thesame time, however, it often highlighted the tragic failure of an individual to fit within society. In thiscourse, we will study three major works: Emily Brontë’s Wuthering Heights, George Eliot’s The Mill on the Floss, and Thomas Hardy’s Tess of the D’Urbervilles. These novels will provide opportunities to explore several key questions about the idea of selfhood in Victorian society: how is the self affected by social repression or violence? How do expectations of gender, sexuality, and class affect relationships between men and women? Can characters act heroically within the bounds of normal, everyday life? How do authors critique social forces that were supposed to “mold” the self such as marriage, religion, and education?", "gradesOffered": "12", "courseName": "Social Misfits in the Victorian Novel", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 458, "model": "registrationApp.course", "fields": {"courseCredit": "Spring Semester Course, 0.50 credits\tK. Luten", "courseDescription": "This year the course will focus on contemporary drama, reading eight British and American plays written and performed in the past twenty-five years: Caryl Churchills Cloud Nine, Tom Stoppards Arcadia, Alan Bennetts History Boys, Martin McDonaghs Pillowman, August Wilsons Fences, John Guares Six Degrees of Separation, and John Patrick Shanley’s Doubt.  Some of these are characterized by sensational subject matter and unconventional dramatic structures; there may or may not be a thematic link between them. Indeed one question to consider is whether a late-twentieth, early twenty-first zeitgeist exists, and if it emerges, on the stage, at least on the evidence of these plays. We will study them both as texts and as theater: be prepared to act!", "gradesOffered": "12", "courseName": "Modern Drama", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 459, "model": "registrationApp.course", "fields": {"courseCredit": "Spring Semester Course, 0.50 credits\tS. Bender", "courseDescription": "Films tell stories in unique ways; they employ a grammar and syntax all their own. This course will address the question of how films do what they do. As we begin to probe more deeply beneath the surface of cinema history, theory and criticism, we empower ourselves to become more sophisticated viewers, viewers capable of engaging in a dynamic and authentic relationship with this (almost) magical form of art. This course will take a workshop approach: we will view scenes from touchstone films together, discuss the hows and whys of specific scenes, and write, analyze, compare and contrast the techniques of many great cinematic artists, including Griffith, Chaplin, Hitchcock, and Welles. Students will havemany unique opportunities to put the ideas about film criticism we will study into practice, through analytical essays, personal responses and by creating their own critic’s journal.", "gradesOffered": "12", "courseName": "Film Theory and Criticism", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 464, "model": "registrationApp.course", "fields": {"courseCredit": "Fall Semester Course, 0.50 credits\tC. Hood", "courseDescription": "The sentence has plenty of room to unwind in prose; confronted by the end of the page, the sentence simply and magically continues at the left edge, one line down.  Expansive in its Manifest Destiny, theprose sentence can grow lazy and complacent. This same sentence, placed in a poem, confronts the line’sPacific, a limit to its expansiveness. The tension between the growing sentence and the limiting line results in the quality that most distinguishes poetry from prose: compression.  In this course, we willexamine the nature, the types and the effect of poetic compression. Starting with a detailed investigationinto Emily Dickinson’s grammar and syntax—Dickinson, whose riddling, elision-marked poems stood in such contrast to the hypotactic poetry of her time—we will continue by looking at the American Moderns, including Pound, whose endorsement of parataxis was anticipated decades earlier by Dickinson.  Our course will culminate with Berryman’s The Dream Songs, a collection that owes its intentions toWhitman and his “Song of Myself” but owes its poetic method to Dickinson. This class will focus on writerly reading, seeking always to understand not only what a poem accomplishes, but how a poemaccomplishes. Written work for the course will include two major papers complete with appendices andan independent project.", "gradesOffered": "12", "courseName": "Modern American Poetry and Poetics", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 471, "model": "registrationApp.course", "fields": {"courseCredit": "Fall Semester Course, 0.50 credits\tW. Fisher", "courseDescription": "We will be studying a selection of foundational texts of African American literature from the period of the Harlem Renaissance to the present. In reading these texts, with their varied literary and historical representations of race in the United States, we recognize from the start that there is no fixed body of African American literary “masterpieces”; rather, the texts we will study are very much involved in the question/debate of just what should an African American literature be (and, in turn, just what should we mean by negro/black/afro/African American). The course then will pay particular attention to the cultural work of African American literature, and the ways in which that literature has shifted and left an indelible mark on American literature and culture.  And in doing so, we will situate each work in its aesthetic, social, historical, and ideological context.Among many questions, we will consider: What, if anything, is common to African-American literature and culture?  Does this literature have a distinct social purpose? What are the artistic values of African- American literature?  How do gender and sexuality play into notions or definitions of Blackness? How does literacy dovetail with freedom, citizenship and power?  How do African-American writers speak to each other? Works include writers such as: Wright, Baldwin, Morrison, Fuller, Locke, and Reed.", "gradesOffered": "12", "courseName": "African-American Literature", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 512, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "The Invention  of ModernityStudents in the tenth grade will continue their focus on the making of the modern world, and an in-depth analysis of the Constitution of the United States of America serves as our point of departure.  Here we will consider the lasting historical significance of this document as a manifestation of the guidingprinciples of the American Revolution and a modern enlightened political and social perspective.  We will frame our analysis in a global context and will consider the implications of the Declaration of Independence and the Constitution on the world scene. Overall, we will continue to explore the varieties of historical interpretation and we will employ intellectual, social, cultural, political, and economic emphases as we work through the nineteenth century. The idea of \"revolutions\" supports our initial analysis, and we will focus on the global impact of industrialization. Subsequently, we will explore the emergence and dominance of nationalism and nationalist discourses as we assess the consequences of modernization. The impact of westernization and the threat of western encroachment on China, Japan, India, Africa, and South America will be a focus, and we will explore why these areas surrendered(mostly unwittingly) to the western powers and how these areas responded to colonization. The marriage of imperialism and nationalism will loom large in our survey, and we will arrive at the dawn of the GreatWar as we conclude our year.Research papers will be required in the second term in which students employ a historiographic analysis of a single issue/ debate.", "gradesOffered": "10", "courseName": "Topics in World History II", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 532, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "The 20th CenturyStudents in the eleventh grade will focus on twentieth-century world history.  Beginning with the movements for social and political and economic reform that were prevalent in Europe and the United States at the dawn of the twentieth century, the course will continue through the age of catastrophe with a study of World War I, the Russian Revolution, the world-wide economic depression, and World War II. Our close study of these events will promote the integrated approach to world history as we will see how so-called regional conflicts always existed in a global context. The interaction of international players will become increasingly apparent over the course of the twentieth century, and students will take an in- depth look at anti-colonial movements in Africa, Asia, and the Middle East, while relations between the United States and Latin America will also be considered. The ascendancy of China on the world sceneprovides another overarching theme, and we will consider revolutions (\"Cultural\" and otherwise) in China to understand the rising shift in geopolitical power. In the latter half of the year students will examineissues surrounding the dropping of the atomic bomb, and the beginning of the Cold War. An examinationof the march for civil rights will also have a global perspective. The final assignments will be devoted tothe end of Communism in Europe and the economic rise of nations in Asia, the Iranian Revolution and the emergence of fundamentalist movements around the globe.There will be no long-term research projects.  Students interested in continuing to pursue independent work in history should apply for the independent history research seminar, for a 1/2 credit.", "gradesOffered": "11", "courseName": "Topics in World History III", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 540, "model": "registrationApp.course", "fields": {"courseCredit": "Fall Semester Course, 0.50 credits\tK. Slick", "courseDescription": "This course will explore the idea and practice of fundamentalism in the modern world. Our primary goal will be to define the term and seek to understand the factors giving rise to secular and religiousmanifestations of fundamentalist thought.  While many fundamentalist movements point to the revival ofso-called purer and more authentic religious and ideological forms and practices, we will approach fundamentalism as a condition of modernity informed by notions of a contemporary \"spiritual crisis\". The character of the putative \"revival\" behind fundamentalist movements will allow us to see the historical forces shaping movements that actively seek to disrupt the current world order. The centralityof identity will loom large in our investigation, and the impact of fundamentalism on national identity and gender and sex roles will be a key point of consideration.  Our investigation will be broad in an effort tobalance historical investigation with current events, but we will certainly examine manifestations of ultra-nationalism, Islamic fundamentalism, the evangelical tradition, Jewish extremism, and the use of terrorism in order to see the confluence of perceived crisis, the pressures of modernization, violence, andthe search for meaning and identity in the modern world.  In addition, we will examine the deployment ofa discourse on fundamentalism to see who defines what is \"fundamentalist\" and how the effects of this deployment condition subsequent political agendas and actions.", "gradesOffered": "12", "courseName": "Fundamentalism/ Extremism/ Terrorism", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 547, "model": "registrationApp.course", "fields": {"courseCredit": "Spring Semester Course, 0.50 credits\tS. Lederman", "courseDescription": "The purpose of this course is to examine the historical factors that have contributed to shaping gender, class and race identity in many different cultures. Through monographs, documentary films, and novelswe will consider paradigms for the development of modern concepts of femininity, masculinity, socialstatus, ethnicity and race in the United States.", "gradesOffered": "12", "courseName": "Issues in Identity: Gender, Race and Class", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 558, "model": "registrationApp.course", "fields": {"courseCredit": "Spring Semester Course, 0.50 credit\tM. Tewell", "courseDescription": "While we wake each day in comfortable surroundings, nearly half of the world’s population lives on less than $2 per day. This course will focus on the plight of this population, a world apart from the traditional “rational” world of economic decision-making. In the developing world, most commodity and economic calculations can be overshadowed by political and social priorities, such as unifying the nation, replacing foreign advisors with local decision makers, resolving tribal or ethnic conflicts, or preserving religious and cultural traditions. We will look at specific topics such as trade theory and policy, foreign aid and investment, and debt issues. Throughout, we will address the fast-expanding impacts, both positive and negative, of globalization on these populations.", "gradesOffered": "12", "courseName": "The Developing World: “Globalization and Its Discontents”", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 561, "model": "registrationApp.course", "fields": {"courseCredit": "Fall Semester Course, 0.50 credits\tJ. Stolper", "courseDescription": "This course will explore the history of the modern Middle East from the late 18th century to the present. We will begin with an investigation of the definition of the “modern Middle East.”  Then usingNapoleon’s 1798 invasion of Egypt as a starting point we will briefly survey the history of the region,highlighting major themes. This will be followed by an in-depth investigation of some of the major questions and debates such as the Arab-Israeli conflict, the Iranian Revolution, economics and oil, political Islam, and the war in Iraq.", "gradesOffered": "12", "courseName": "The Modern Middle East", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 562, "model": "registrationApp.course", "fields": {"courseCredit": "Fall Semester Course, 0.50 credits\tS. Lederman", "courseDescription": "The purpose of this course is to examine the causes, phases and consequences of modern revolutions inFrance, Haiti, Russia, Iran and China. We begin with a review of the French Revolution, where we examine the social, economic, political, religious and cultural factors that led to the Revolution and contributed to enduring changes. By analyzing the role of men and women from different classes andideological orientations, we will begin to address questions about the influence of different factions. Primary source readings combined with articles and essays by historians will enable us to consider various ways in which events leading to revolutions, as well as the results of the revolution, have been interpreted. Study of the slave revolts in Haiti will reveal how questions raised about human rights in the French Revolution led to the independence of slaves in Haiti.  In assignment two we will concentrate onthe Russian Revolution, and emphasize the ideological, as well as the social and economic factors driving the Revolution. In addition, we will read about the role of international events, in particular the way thethreat of foreign invasion influenced Russian leaders. We will conclude with a brief examination ofRussia in the late 20th and early 21st century. In assignment three, the focus will be on Iran, the origins and some outcomes of the Islamic Revolution.  Finally in assignment four we will study the ChineseCommunist Revolution. In addition to examining themes raised in our discussion of the French and Russian revolutions, we will consider the issue of human rights in Iran and China in the late 20th century. By analyzing the work of many historians along with primary sources, students will be able to identify important themes that have shaped modern revolutions.", "gradesOffered": "12", "courseName": "Revolutions", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 579, "model": "registrationApp.course", "fields": {"courseCredit": "Spring Semester Course, 0.50 credits\tK. Slick", "courseDescription": "This course is a survey of the history of art in the second half of the twentieth century.  Our investigation focuses on the modernist and post-modernist challenge to traditional notions of \"art\" (in particular, therejection of mimetic representation as the standard of representation), and we will witness the turn towardand celebration of abstraction (in the first instance) and then the emergence of art that defies categorization.  Subsequently, we will examine the responses to the modernist critique of traditional art,and this will open up a space for the exploration of a new philosophy of art.  Arguably, anything can be awork of art, but not everything is.  How do we understand the distinction between art and those things that are not art?  Arthur Danto, pre-eminent art critic, argues \"we are living in a time when anything can be awork of art, when works of art can be made of whatever material seems suitable, and where there are no perceptual criteria in virtue of which some things are works of art and some things are not.\" Therefore, the overarching purpose of this course is to explore this condition and to wonder how we begin to understand the meaning of works produced in the last fifty years.  We will survey what is left of thetraditional discipline of art history after the modernist/postmodernist challenge of the last several decades, and we will engage a broad variety of artists and art to support our project. The challenges (and rewards) of contemporary art are marked by interruption: gone is the certainty of established hierarchies, procedures, frameworks, and categories.  In the end, we will retrain our eyes to see the possibility of art everywhere but the existence of art only here and there.", "gradesOffered": "12", "courseName": "Art/Non-Art: Art History after the (Post)Modernist Challenge", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 596, "model": "registrationApp.course", "fields": {"courseCredit": "Spring Semester Course, 0.50 credits\tJ. Stolper", "courseDescription": "Anybody can be good in the country. There are no temptations there.-\tOscar WildeWe live in one of the most famous cities in history.  But how can we understand the meaning of cities? This course seeks to foster a critical understanding of the cultural and artistic processes, planning actions, and policies that have influenced the history of cities and urbanization over time.  In order to understand cities we will examine the social and political dimensions of architecture and public space, as well as issues of preservation and conservation. We will explore this topic through case studies of specific cities at unique moments of historical importance.  Case studies will include, but are not limited to, Rome, Tokyo, Machu Picchu, Tel Aviv, Istanbul, New York City, Chicago, Salt Lake City, Versailles, and Shanghai. The last two weeks of the course will include presentations and discussion of student research on an era and city of their choice.", "gradesOffered": "12", "courseName": "The City in History", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 621, "model": "registrationApp.course", "fields": {"courseCredit": "Spring Semester Course, 0.50 credits\tE. Lambert", "courseDescription": "Call them long short-stories or little novels, there is a body of wonderful fiction in the Western tradition that is too long for inclusion in the first category yet too short for the latter.  A novella permits both thecharacter development that is one of the chief pleasures of novel reading and the intensity orconcentration of effects we associate with the short story.  Readings will include Tolstoys \"Ivan Ilych\"; Dostoyevskys \"Notes from Underground\" (or \"The Gambler\"); Chekhovs \"Ward Six\"; Kafkas \"Metamorphosis\"; Thomas Manns \"Death in Venice\"; Henry James \"The Beast in the Jungle\"; one of the \"Roman Fever\" stories by Edith Wharton; Joyces \"The Dead\"; Willa Cathers \"Old Mrs. Harris\"; Tillie Olsens \"Tell Me a Riddle\"; James Baldwins \"Sonnys Blues\"; and one of Alice Munros longer stories. We will make thematic as well as formal links between our novellas, and students will be invited to try their hand at the form.", "gradesOffered": "12", "courseName": "The Novella", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 623, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit\tA. Glassman", "courseDescription": "Each piece of American Literature presents writers trying to define the American psyche. How can it be independent, balanced, realistic, secure? What does it owe to community? What is its debt to nature?Where can it find honor and love? Do American writers answer these questions in new ways in every period? How is the fiction related to its cultural context?  Beginning with the nineteenth century, we willmove forward, examining examples of romanticism, realism, and modernism.Reading and interpretation of narrative fiction are central. So is writing in various modes--critical, personal, topical, creative – and a focus on developing style, structure and voice in each student’s writing.Issues of identity, society and spirit will be explored in such works as essays by Emerson, Hawthorne’s Selected Stories, excerpts from Thoreau’s Walden, Melville’s Moby Dick, Faulkner’s The Bear; Hurston’s Their Eyes Were Watching God; O’Connor’s Wise Blood and some contemporary stories.", "gradesOffered": "11", "courseName": "American Literature: Self/Society/Cosmos", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 625, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit\tK. Luten", "courseDescription": "“It is easy to live after the world’s opinion; it is easy in solitude to live after our own; but the great man is he who in the midst of the crowd keeps with perfect sweetness the independence of solitude.”  -- RalphWaldo EmersonEmerson articulates the challenge faced by countless characters in American fiction: fulfilling duties both to oneself and to ones society. Many of the texts we will read in this course focus on characters who struggle to achieve such a balance, with varying degrees of success; other works feature characters who look to the world of their own dreams and imaginations to find some sense of hope or meaning in a world that seems to have no place for, or to make no sense to, them.Texts will be chosen from Emersons \"Self-Reliance,\" short stories by Hawthorne, Twains Adventures of Huckleberry Finn, Whartons Age of Innocence, Fitzgeralds The Great Gatsby, Faulkners As I Lay Dying, Hurstons Their Eyes Were Watching God, McCullerss The Heart Is a Lonely Hunter, Kushners Angels in America, Part I, Toni Morrisons A Mercy, and Junot Diazs The Brief Wondrous Life of Oscar Wao. Writing assignments include critical essays, personal and autobiographical essays, as well as creative assignments in the short story.", "gradesOffered": "11", "courseName": "Rebels, Conformists, and Dreamers", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 626, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit\tL. Stifler", "courseDescription": "The unifying theme of this course can be identified as the quest for the American dream.  Although the tradition of the \"dream\" only seems to begin with Emerson and Thoreau, in fact, one might argue that the tapestry of our literature should reflect a diversity that more accurately represents all of America. Thus, with this aim in mind, slave narratives will be considered side by side with the Puritan New England of Nathaniel Hawthorne.  American frontiers will be explored through the vision of Native Americans and ofother immigrants to America, as well as through the more traditional Romantics, as in Melvilles Moby- Dick. Our journey inland will juxtapose the freedom of the dream with the encroaching realities of civilization via the wit and wisdom of Mark Twain. We will consider New York in the early twentieth century, as we see how the Harlem Renaissance of Zora Neale Hurston will echo its white counterpart in the Jazz Age, The Great Gatsby.  As narrative voices begin to shift and redefine America, artists such as Ralph Ellison, in Invisible Man, and Ernest Hemingway begin to reshape our American identity; in so doing, each succeeds in enlarging the limits of the American dream.", "gradesOffered": "11", "courseName": "American Literature: New Frontiers and the American Dream", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 629, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit\tS. Bender", "courseDescription": "America was forged in revolution, but somewhere the transcendental, visionary version of the nation was exchanged for a more materialistic vision of “success”. Rebels and outsiders are individuals engaged in adynamic, confrontational relationship with their society. Sometimes trying to break out, sometimesattempting to enter and find their own niche, they often live at the edge, challenging the dominant values of the culture. The rebel may attempt to assert his voice in a society that would rather not hear it (or even actively try to quash it). He may seek to change the status quo and create a more dynamic, multivalent social order in an attempt to return to the rugged individualism upon which America was founded. The outsider may seek a way in, or (perhaps more frequently) a way out, sometimes through means that are not without a cost.In the first semester of this course we will encounter the voices of slaves, outcasts, naysayers and rebels through writers like Emerson, Hawthorne, Poe, Twain, Wharton, and Fitzgerald. The second half of the course will continue exploring the voices of rebels and misfits through more contemporary authors as Kesey, Roth, Oates, Whitehead and Diaz. The class will also feature \"interdisciplinary days\" during which students will encounter the central themes of the course-- not in literature, but in art, music and film.  A variety of written work, creative as well as analytical, will be required of each student, as we ask ourselves, whose America is it, anyway?", "gradesOffered": "11", "courseName": "American Literature: Rebels With a Cause", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 701, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                                 L. Hanauer", "courseDescription": "Students learn to make a range of decorative papers. They create books using their handmade paper, paste paper, Japanese marbled papers, and stamped paper. They learn to make books based on Western andEastern binding structures. Students also combine the ancient crafts of papermaking and bookbindingwith the computer, using Photoshop to alter image and text. Students transfer personal photographs onto handmade paper and scan photographs and artifacts to create family albums or baby books. Studentsrecycle supermarket boxes as Pop Art bindings. Second year students may work with nontraditionalmaterials to develop the text, imagery, and sculptural aspects of the book. ", "gradesOffered": "9,10,11,12", "courseName": "Book Arts: Papermaking/Printing/Bookbinding", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: None"}}, {"pk": 704, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits                                                                                            C. Bowen", "courseDescription": "This class meets once a week for 2 consecutive hours of drawing from a model and students maintain a sketchbook.  At this level, the student is guided to a literate command of modeling: the use of light anddark values as compositional as well as form-enhancing factors.  Students are also taught to observe andarticulate tension, torsion, and weight, as exerted by any given pose upon the models limbs and torso.", "gradesOffered": "9,10,11,12", "courseName": "Life Drawing II", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Life Drawing I"}}, {"pk": 705, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                                   C. Bowen", "courseDescription": "Working from the fundamentals of color learned in Painting 1, students develop a personal style by studying the work of master painters through art history.  Students experience a hands-on approach to art history by experimenting with authentic materials and techniques such as egg tempera, gilding, and glazing.   The course takes students through prehistoric cave paintings, Egyptian scrolls, Early Greek black figure technique, medieval gilding, Early Renaissance egg tempera, High Renaissance glazing techniques, and Impressionist pastel painting. Rather than memorizing names and dates, we look at paintings through slide shows and museum visits. and students begin to discover artists whose style they want to emulate.  A portrait model will be used in an assignment that compares figure styles throughout art history. The chronological presentation of information helps students to order and make sense of styles in history. This combined study of master artworks and a consistent painting practice helps the students develop a personal direction in their painting.", "gradesOffered": "9,10,11,12", "courseName": "Advanced Painting", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Painting I, Painting, Collage and Assemblage or Watercolor Painting"}}, {"pk": 706, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                             L. Do-Brooks", "courseDescription": "This intensive drawing course trains the eye to see.  Through a deliberate process, the student acquires the ability to perceive three-dimensional form accurately and render it convincingly in two dimensions: that is drawing.   This course helps students to understand the world around them by learning to grasp visual relationships and interpret what they see.  Drawing is a primary building block that will help students in any further artwork and in many other fields as well.  This course is appropriate for all levels of development.", "gradesOffered": "9,10,11,12", "courseName": "Beginning Drawing", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: None"}}, {"pk": 707, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This intensive, full credit course meets for 4 hours per week (2 hours drawing from the model and 2 hours of assigned drawing projects, including portraiture, anatomical casts, and, as scheduling permits, theantiques at the Metropolitan Museum of Art).  Students also maintain a sketchbook/journal.  Instruction isstructured for the achievement of controlled scale and placement of the figure on the page.  Along with these expectations, the student is taught to articulate basic structural characteristics of the human figureand to express directional and space relationships observed in any given pose.  Work in a variety of mediasuch as charcoal, conte crayons, graphite, pastel, watercolor, pen, and wash is taught.2. Written permission from a parent", "gradesOffered": "9,10,11,12", "courseName": "Life Drawing I", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite:     1. One year of Beginning Drawing (706)"}}, {"pk": 708, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                             L. Do-Brooks", "courseDescription": "Watercolor is a vibrant and exciting medium well suited to self-expression. In this class, students develop their understanding of this transparent media.  After gaining control of the basic tools, students explore avariety of painting methods and concepts. In the second half of the course, students create paintings thatillustrate individual ideas or atmospheres in landscape, figurative, spatial and still life formats.", "gradesOffered": "9,10,11,12", "courseName": "Watercolor Painting I", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Beginning Drawing (706) or Design/Drawing Techniques I (752)"}}, {"pk": 709, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                      D. Orkin-Footlick", "courseDescription": "This is a continuation of Design/Drawing Techniques I. In this advanced seminar and workshop, students work independently to expand ideas and concepts explored in the beginning class.  Projects relating to imaginative and observational drawing, color and composition are emphasized.  Assignments combining the works of different artists will be explored.  Other assignments include a CD or album cover, a book jacket, and a personal memory composition.  Materials include colored pencils, watercolors, tempera, printmaking, collage, charcoal, and pastels.Visits to artists studios, museums, and galleries will augment the studio time.", "gradesOffered": "9,10,11,12", "courseName": "Design/Drawing Techniques II", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Beginning Design/Drawing Techniques I"}}, {"pk": 710, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                      D. Orkin-Footlick", "courseDescription": "This is a continuation of Drawing/Design Techniques II.   In this advanced seminar and workshop, students work independently on illustrating personal memories and other individual projects of their choice. The design assignments will include a corporate identity project and a brochure for an art exhibition.     Drawing  continues  to  be  an  important  part  of  this  course.  Students  improve  their observational and imaginative drawing skills with assignments in landscape and botanical studies. Materials include colored pencils, watercolors, tempera, printmaking, charcoal, and pastels.", "gradesOffered": "9,10,11,12", "courseName": "Design/Drawing Techniques III", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Design/Drawing Techniques II"}}, {"pk": 711, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                                   M. Zexter", "courseDescription": "In this introductory black and white photography course, students explore how the camera can be a tool for art making.  They learn how to use a 35mm SLR manual camera, process negatives, print photographs in the darkroom, and mat to produce a finished piece of artwork. Students work on a semester long assignment called \"Studies in Composition\" in which they explore the formal aspects of art such as perspective, texture, pattern, shadow, and line. Other assignments include depth-of-field, blurred motion, self-portraits, and double exposure.   Assignments are to be photographed outside of class time.   Class critiques occur after the completion of each photographic assignment.. 35 mm camera with manual controls needed for this course. See Ms. Zexter if you need to borrow a camera for the semester.", "gradesOffered": "9,10,11,12", "courseName": "Photography I", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: None"}}, {"pk": 712, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                                      M. Zexter", "courseDescription": "This course offers students an opportunity to further refine and increase their understanding of film exposure,  development,  and  the  finished  print.  During  the  first  semester,  they  explore  portraiture,documentary photography and sequential imagery, with the option of printing 11\" x 14\". Students also experiment  with  digital  photography  and  mixed-media  techniques.  In  addition,  they  make  pinholecameras, use Holga cameras and do large-scale color printing.  Class trips to museums and galleries supplement the curriculum. Students also give a slide presentation on an artist/photographer of their choosing.  Class critiques occur after the completion of each photographic assignment.  Assignments areto be photographed outside of class time.  35 mm camera with manual controls needed for this course.", "gradesOffered": "9,10,11,12", "courseName": "Photography II", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Photography I"}}, {"pk": 714, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                                    D. Rubin", "courseDescription": "This course surveys the diverse and deceptively simple medium that is clay.  Students learn a broad range of forming techniques and receive intensive instruction in wheel throwing.  This curriculum lets studentschoose their own assignments and set their own goals.  Assignments are often long term and ambitious inscope.  Students are encouraged to pursue this medium in a variety of ways from sculptural to functional. Participants in this course will also consider the issues and ideas that accompany the making of objects inhistoric and contemporary contexts.", "gradesOffered": "9,10,11,12", "courseName": "Ceramics", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: None"}}, {"pk": 716, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                                    D. Rubin", "courseDescription": "Students will work on individual assignments based on previous experience and explore increasingly ambitious forms.   Advanced techniques will be introduced as students explore multi-part forms and focus on the formal and technical challenges of complex forming strategies.  Glaze formulation, working with porcelain and increased involvement with kilns and firing are all part of the curriculum.", "gradesOffered": "9,10,11,12", "courseName": "Advanced Ceramics", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Beginning Ceramics"}}, {"pk": 717, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit\tMr. Brune", "courseDescription": "This is a practical course in which students study the art and craft of stage production: lighting, scene painting, stage management, prop and scenic construction and sewing. Students undertake assignments in which they, as members of the Dalton Theater and Dance community, work in teams to hone their skills by building and running actual productions on The Martin Theater stage and in Studio Six.", "gradesOffered": "9,10,11,12", "courseName": "Stagecraft and Production", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 718, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                                   C. Bowen", "courseDescription": "Using the medium of acrylic paint, the student will complete a highly structured series of assignments, designed to teach the fundamentals of color theory.  The student will be able to identify the hue, intensity,and luminosity of an observed color, and replicate these qualities by mixing paint.  Assignments becomeincreasingly complex as the student masters each given problem and learns to paint detailed, complex still-lifes and portraits.  An important aspect of the course is learning the subtleties of paint application.Initial assignments are painted with thick impasto paint, using only the palette knife (no brushes) to applypaint to the surface.  Later assignments deal with brush painting methods such as underpainting, layering and blending.After completing this course, the student will be able to successfully mix colors and paint artworks that create the illusion of form, space, and light.", "gradesOffered": "9,10,11,12", "courseName": "Painting I", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: None"}}, {"pk": 722, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit\tMr. Kennedy, Mr. Sloan", "courseDescription": "Acting means \"living truthfully under imaginary circumstances.\" The acting studios are taught by Mr. Kennedy and Mr. Sloan for alternating semesters. Mr. Kennedy focuses on the naturalistic performancestyle where the actor filters needs and actions of the role through his own personality. Students work onscenes and monologues and are guided through the rehearsal process and performance of established texts. Mr. Sloan’s work is based around improvisation exercises, character study, and devising original material to explore a range of approaches to acting and performance.", "gradesOffered": "9,10,11,12", "courseName": "Acting Studio", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 723, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "Design students work on a broad range of studio projects in drama, musical theater and/or dance and performance. Designers in this course will assist on faculty directed productions in the Martin Theater for the fall and winter as Associate Designers and are welcomed to be part in the collaboration andproduction process. As final projects for the semester, designers are invited to collaborate with DirectingStudents and DTW choreographers on a production.No experience necessary, though some knowledge of drawing is useful.Architecture, Drawing, Assemblage, Dance and Stagecraft students from last year are encouraged to enroll.Full Year Enrollment, 1 credit\tMr. Maldonado", "gradesOffered": "9,10,11,12", "courseName": "Design for the Stage", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 724, "model": "registrationApp.course", "fields": {"courseCredit": "Full-Year Semester Course, 1 credit", "courseDescription": "A full-year advanced studio for those whove taken two years of theatre classes or by invitation of the department.  With Mr. Kennedy, students will engage in an intense inquiry into the rehearsal processincluding script analysis, acting craft, and scene study in pursuit of authentic performance from fixedtexts.  Special focus is on the integration of vocal and physical adjustments to create characters very different from the actor. Introduction of the IPA (International Phonetic Alphabet) as a tool for increasing vocal expressive range and learning dialects. With Mr. Sloan, students will focus on differentperformance styles, developing original work, and devising texts from non-theatrical material.", "gradesOffered": "9,10,11,12", "courseName": "Advanced Acting Studio", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: 1 year of Acting Studio, by permission\tMr. Kennedy, Mr. Sloan"}}, {"pk": 725, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "The Dalton Chorus engages in an exciting and varied curriculum of rehearsals and performances designed to take students on a journey through music history, via the rich canon of the choral repertoire. Styles and genres explored cover the gamut from chant to the renaissance, classical and romantic masters, the 20th century (including everything from Stravinsky to jazz to Sondheim) right up to the latest trends in contemporary and world-music.Prospective students of all backgrounds and experience levels are invited to join, since the rehearsal process is geared toward gaining the skills necessary to be fluent, knowledgeable and confident singers. Additional opportunities for soloing, chamber groups, outside performances/collaborations, and tours (including Europe and other parts of the globe) are ongoing and encouraged.", "gradesOffered": "9,10,11,12", "courseName": "Chorus", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Permission of the instructor"}}, {"pk": 727, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit\tJ. Brown", "courseDescription": "The Dalton Orchestra, open by audition to all string and wind orchestral instruments, performs works from the standard orchestral literature from the Baroque through the present day, with attention to thedevelopment of techniques appropriate for different musical styles. Recent performances included worksby Haydn, Beethoven, Sibelius, Hindemith, Rossini, and Arvo Pärt.The orchestra rehearses four times per week and performs throughout the year, and occasionally travels to perform off-campus. Outstanding participants are frequently invited to appear as soloist with theorchestra.", "gradesOffered": "9,10,11,12", "courseName": "Orchestra", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Audition with conductor"}}, {"pk": 730, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits", "courseDescription": "Here students can strengthen their technique and dance skills while training in a variety of modern dance styles. This course is an excellent choice for students who have completed a year of Dance Mix or havehad some prior dance experience.", "gradesOffered": "9,10,11,12", "courseName": "Dance Tech", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Dance Mix or equivalent"}}, {"pk": 731, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit, Approval Required", "courseDescription": "This class focuses specifically on developing greater skill as a dancer through an in-depth study of technique. The foundation of the course is a challenging technique class which meets twice a week for anhour and 15 minutes. The class will integrate the study of a variety of modern dance styles, ballet andPilates (a rigorous conditioning method).", "gradesOffered": "9,10,11,12", "courseName": "Intermediate Dance Technique", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Enrollment by audition only"}}, {"pk": 732, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "This course has been designed for the student who wants a challenging class in modern technique and improvisation. Through technical training and creative exploration, the students will work to developtheir own movement vocabulary and style. This class is ideal for students interested in strengthening theirtechnique and exploring the creative elements of modern dance.", "gradesOffered": "9,10,11,12", "courseName": "C.D.I.: Contemporary Dance and Improvisation", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Dance Mix"}}, {"pk": 733, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits", "courseDescription": "This course is designed for the student who wants a rigorous, fast-paced class focusing on the techniques of Hip Hop and African Dance. This class will help to develop rhythmic awareness, cardiovascularendurance and coordination while students learn the origins of Hip Hop through studying African dance.African Dance sessions will be accompanied by live drumming.", "gradesOffered": "9,10,11,12", "courseName": "Hip Hop & African Dance", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: None"}}, {"pk": 734, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This course is especially designed for the experienced dance student and will focus on the art of dance performance. Technical, improvisational and performance skills will be developed through anexploration of advanced dance theories and styles. There will be a focus on proper placement and centering and learning how to use the body most efficiently.the permission of instructor only.", "gradesOffered": "9,10,11,12", "courseName": " Advanced Dance Technique", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Contemporary Dance and Composition and Intermediate Dance Technique. Enrollment by "}}, {"pk": 736, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit\tG. Makos", "courseDescription": "This performing group, now meeting four times weekly, plays a variety of styles in the jazz repertoire within a big band format. Emphasis is placed on further developing ensemble and improvisatory skills. The group performs at various functions throughout the school year including a fall and spring concert.", "gradesOffered": "9,10,11,12", "courseName": "Jazz Ensemble", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Audition with instructor"}}, {"pk": 740, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit\tMr. Kennedy", "courseDescription": "A seminar with practicum for advanced students. Problems confronted include: reinterpretation and development of a production strategy for a classic text; examination of contemporary andclassic texts to illuminate the distinction between Plot and Story; project selection anddevelopment; pre-production preparation, including writing proposals, mission statements, and developing scenic metaphors. Student directors will rehearse scenes both outside and in class. Projects will include; stagings of short passages from classic texts; team directed collaborations developing an approach, rehearsal strategy, and presentation of short scenes; and one longer project with each director on their own in the spring.\tThe last assignment of the year is to generate a proposal for a Theatre Senior Project for the following year.Theatre Apprentice and Master Apprentice Program (TAP and TMAP)These programs give academic credit to students who make substantial contributions to theatre (apprentices) as well as for skilled, seasoned student technicians and designers (master apprentices).  No experience or pre-requisite is required to participate as an Apprentice, and students who’ve taken Stagecraft and worked on shows may be designated “Master apprentice” at the discretion of the design and technical faculty.  All apprentices (including masters) must devote one interval per week to production support or in-depth training and will gather once a month for special projects and instruction. Each TAP and TMAP must serve for eight “quads” (4 hour work calls) in support of production and complete three crew assignments in the course of the year.", "gradesOffered": "9,10,11,12", "courseName": "Directors Workshop", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Permission of instructor, not open to freshmen"}}, {"pk": 742, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits", "courseDescription": "This course is designed to develop a healthy body that is flexible, strong and well-coordinated. We begin with a set of non-stop warm-ups & aerobics followed by rigorous arm and leg work.  We will alsoconcentrate on a series of floor repetitions to shape and tone muscles; hand-held weights are also used.Class ends with a cool down and relaxation. The course will include methods of stretch, strength and cardiovascular fitness. This is a demanding class; students will finish each session feeling alert and energetic!", "gradesOffered": "9,10,11,12", "courseName": "Body Conditioning", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: None"}}, {"pk": 744, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits", "courseDescription": "This course will be a prerequisite for those wishing to take IDT or ADT.  It is also an excellent choice for Theatre students and non-dancers.  As an introductory technique class, it will concentrate on establishing basic dance skills through a variety of movement experiences. The course will focus on the fundamental principles of Modern Dance, Ballet, Jazz and Musical Theater.  Improvisation and composition will also be included.  Guest artists & video viewings are incorporated into the course.", "gradesOffered": "9,10,11,12", "courseName": "Dance Mix", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 748, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits", "courseDescription": "Utilizing yoga, stretching, meditation, and relaxation techniques, this course serves as a way to reduce stress and build a strong foundation for proper centering and control. Through different disciplines, youwill explore a more harmonious and expressive way of moving.  This class is designed for both beginner and advanced students who are interested in developing a healthy body with clearer focus both in andoutside of class.", "gradesOffered": "9,10,11,12", "courseName": "Zen Dance", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: None"}}, {"pk": 752, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                      D. Orkin-Footlick", "courseDescription": "Students explore fundamentals of design and drawing techniques by using mixed media such as colored pencils, pastels, watercolors, pen and ink, printmaking, collage and computers.  Sources for content include landscapes, plants, and animal forms, with a focus on the imaginative and fantastic approach to these and other subjects.  Trips to the Reservoir, Central Park, and the Botanical Garden provide studentswith experience in working from nature.  Students learn basic principles of communication by designing and illustrating their own book, designing a poster, and creating a package or shopping bag design.", "gradesOffered": "9,10,11,12", "courseName": "Design/Drawing Techniques I", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: None"}}, {"pk": 753, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                      D. Orkin-Footlick", "courseDescription": "This course is an introduction to the basic techniques of printmaking, including: linoleum cuts, woodcuts, drypoints, collographs, and monoprints.  Emphasis is placed on the overall design and composition of the print, experimentation with media, and the development of skills to achieve each students personal imagery and style.  The computer may be used to facilitate image making for prints. Some of the assignments may include a poster or book design, printing on fabric or designing a t-shirt.  Class critiques are held during the creative process and at the completion of the print.   Students will supplement the studio experience with trips to galleries, artists studios, and museums.  Visiting artists will also be invited to speak to the classes.", "gradesOffered": "9,10,11,12", "courseName": "Printmaking I", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisites: None"}}, {"pk": 754, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                      D. Orkin-Footlick", "courseDescription": "This  course  involves  further  experimentation  with  printmaking  processes  learned  in  Printmaking  I. Emphasis is on the medium preferred by the student and the exploration in depth of the imagery andtechniques  appropriate  to  that  medium.\tA  portfolio  of  related  prints  may  be  presented  as  a  final assignment.", "gradesOffered": "9,10,11,12", "courseName": "Printmaking II", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Printmaking I"}}, {"pk": 755, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit                                                                                                 R. Bottwin", "courseDescription": "Students in Woodworking will design their own projects and draw accurate plans for them.  While realizing their designs, participants in this class will be introduced to a variety of hand and power tools and how to use them to shape and join wood. The properties and appropriateness of various kinds of wood will also be discussed. The first assignment will be to design and build a lamp.  The second assignment will be to build a small table or box in which the joinery is the focus of the design.  Function, craftsmanship, and finish will be explored in this class.", "gradesOffered": "9,10,11,12", "courseName": "Woodworking", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: None"}}, {"pk": 761, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits, approval required\tR. Bush", "courseDescription": "This performance course is offered to students with a background in playing standard percussion instruments. Students must also be able to read rhythmic notation at the high school level. Performances are given over the year. Keyboard players with good reading skills are particularly encouraged to enroll.", "gradesOffered": "9,10,11,12", "courseName": "Percussion Ensemble", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Reading rhythmic notation, and permission of instructor"}}, {"pk": 776, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits, approval required\tG. Makos", "courseDescription": "This ensemble, which meets two times a cycle, performs jazz standards and original compositions in a small group setting. The group appears at various school functions throughout the year and participates inthe fall and spring concerts.", "gradesOffered": "9,10,11,12", "courseName": "Small Jazz Group", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Audition with instructor"}}, {"pk": 788, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit", "courseDescription": "This course provides an opportunity to learn the art of performance, the craft of choreography, and other essential elements of dance production such as: costuming, lighting, sound. First semester, students studythe art of composing movement through an exploration of the tools of composition: dynamics, design,structure, and thematic development. Working in a laboratory situation, they willchoreograph solos, duets, and larger group pieces. The major focus of the second semester will be the production of a full-length concert dance performance. A minimum of 3 hours per week of after-school dance rehearsal time is required in addition to other production work.is the student’s responsibility to express a desire to enroll in DTW by notifying the ", "gradesOffered": "9,10,11,12", "courseName": "Dance Theatre Workshop/Dance Production", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Advanced Dance Technique.  Enrollment by permission of the instructor only. However, it "}}, {"pk": 791, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Theatre Apprentice Program", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 807, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "P.A.L.S (Peers Advising and Lending Support) will mentor and work regularly with Dalton 8th grade students on a variety of developmentally specific topics and activities. ~ They will prepare to lead classand small group discussions at Dalton, and at select independent and public middle schools, on questionsthat students pose regarding study skills, peer relations, bullying, social networking and transitioning to high school. ~ This outreach to other local schools will broaden their experience and expose them to other school communities.~P.A.L.S. is open to rising 11th and 12th graders who demonstrate a desire to serve as role models, and who are willing to commit an interval period once a week for meetings and middle school visits.This program is open to rising 11th and 12th graders. Rising 10th graders can apply with permission from program director.J. Diaz, A. Geisler", "gradesOffered": "11", "courseName": "P.A.L.S (Peer Mentoring Program)", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 850, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "This class will offer an introduction to poetry and fiction writing. We will meet as a workshop to discuss one another’s work, and students will be expected to turn in both a mid-term portfolio and a final portfolio of writing. This course also functions as a prerequisite for advanced level workshops.", "gradesOffered": "9,10,11,12", "courseName": "Creative Writing Workshop", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "No prerequisite"}}, {"pk": 861, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits\tK. Jones, K. McNary, N. Sin Quee", "courseDescription": "The purposes of the Peer Leadership Group are three: to train seniors to become discussion group leaders with ninth graders; to examine what it means to be an effective and humane leader; and to provide for allparticipants a group experience which cuts through the social assumptions that work to isolate people from each other. The course will meet three times a week through March, and once or twice a weekthereafter until the end of May.  Seniors will meet once a week with their discussion groups until mid- March. Coursework entails understanding group dynamics and studying communication skills, discussing issues of common concern to high school students, and developing ways to present these issues indiscussion groups.  Attendance at a weekend retreat in late August is required, as are planning and participating in the Ninth Grade Retreat in September. The Peer Leadership groups offer an enrichingexperience.  A serious commitment is required of its members; peer leaders must be willing to engross themselves in a group experience for the full year.", "gradesOffered": "12", "courseName": "Peer Leadership Group", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Senior status"}}, {"pk": 862, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits, approval required", "courseDescription": "The Peer Tutoring Program will provide seniors with the opportunity to work with faculty in assisting in the individual instruction of students or in a classroom setting.  Peer Tutors will meet as a group on a bi- weekly basis to discuss issues pertaining to their education and the educational topics. In addition, Peer Tutors will be assigned to a faculty member in the High School, Middle School or First Program.The program is predicated on the notion that tutors will be able to provide a service to others and in doing so consolidate their learning when they are given the opportunity to teach.  In addition, students will gain perspective on methods and principles of education and better reflect on their own experiences. The hope is that Peer Tutors will benefit from this responsibility to others and feel closer to this community of teachers and learners.Students must apply by writing a brief essay about their interests and reasons for wanting to participate. For those selected this essay, as well as faculty recommendations, will serve to assign them appropriately. There will be opportunities to assist in both the academic and arts program.", "gradesOffered": "11", "courseName": "Peer Tutoring", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "Prerequisite: Senior Status\tS. Gaitan, L. Stifler"}}, {"pk": 883, "model": "registrationApp.course", "fields": {"courseCredit": "Fall Semester Course, 0.50 credits\tM. Hyatt", "courseDescription": "This course will survey the history of people of African descent in North America from the age of exploration and settlement, through the 17th to the late 19th century period of enslavement andemancipation, to the 1960s period of the Civil Rights and Black Power movements, culminating in anassessment of critical race theory and the ongoing debate over affirmative action policy.  The goal is to introduce the student not only to the significant events and actions of major personalities, but also to African American history as it stands against the backdrop of the cultural, intellectual, and political histories of the United States as a whole. Among the topics covered are the historiographical debates over the nature of slavery, the rise of black leadership, the nature of due process and black rights, the growth of an emerging struggle for equality throughout the 20th century, and the extent to which race continues to problematize all aspects of American polity in the 21st century.", "gradesOffered": "12", "courseName": "Introduction to African American History", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 893, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 0.50 credits", "courseDescription": "This course explores how modern philosophers have thought about ethics in the context of whatNietzsche called “the death of God.” The course poses these questions:  as religious faith became a private matter, how were people to reach a public consensus on issues of right and wrong?  In the absence of a religious foundation, how could people even conceive of right and wrong?  In the absence of a divine authority, can right and wrong be anything more than personal opinion and social convention?  We will consider the basic ideas of modern philosophers who have concerned themselves with these questions.We will consider key arguments made by David Hume, G. E. Moore, and Alisdair MacIntyre in the Fall semester, and then look at the ethics of Immanuel Kant, Ludwig Wittgenstein, Susan Wolf, Richard Rorty and Emmanuel Levinas in the Spring.  Students will concentrate on learning how to read these difficult texts—which means learning how to be precise with language and how to test that language against concrete examples—as well as on the substantive questions raised.Thursdays 6:30-8:30pmOpen to 11th and 12th graders (and 10th graders with permission of instructor)T. deZengotita", "gradesOffered": "12", "courseName": "Modern Ethics Since The Death Of God", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 894, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "We live in a world of dangerous ideas that threaten to change the world as we know it. In this term’s seminar in Applied Ethics we will evaluate these powerful ideas and their impact on current issues in our society. There will be four units to this course: Foundations of Morality; Violence (Causes and Prevention); the Future of Marriage; and Designer Babies. Here are some of the questions that we will discuss:1.   Is there a basis for morality, and, if so, what are its foundations? Is there any reason to prefer one system of morals over another?2.   Is most violence perpetuated by people not so different from us? Do we have the free will tomake any choices in our lives? Is punishment ever justifiable?3.   Is the Institution of Marriage just a quaint remnant from a by-gone era that should no longer be supported by state recognition and financial benefits? Who gets to decide: the legislature, thecourts or each of us for our self?4.   Should we use biological technology to design “better” children?Our readings will include newspaper and magazine articles, cases, and excerpts from books by contemporary experts and great thinkers of the past such as: Aristotle, Hobbes, Kant, Steven Pinker, Robert Wright, Jonathan Glover, Joshua Greene, Stanley Milgram, and Michael Sandel.Tuesday Afternoons from 3:45 to 5:45\t\tand Thomas Berner Wendela315@hotmail.com", "gradesOffered": "11", "courseName": "Interschool Seminar - Advanced Topics in Applied Ethics: Dangerous Ideas", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": "No prerequisites. Limited Enrollment. For credit."}}, {"pk": 895, "model": "registrationApp.course", "fields": {"courseCredit": "Full year course, 0.50 credits", "courseDescription": "The first semester of this course introduces students to core ideas in media theory.  Readings are taken from Marshall McLuhan’s Understanding  Media, Walter Ong’s Orality and Literacy, Neil Postman’sAmusing Ourselves to Death, Henry Jenkins’ Convergence Culture, Sherry Turkle’s Life on the Screen,and Thomas de Zengotita’s Mediated.\tThe aim is to familiarize students with the basic argument—namely, that media themselves can have hidden psycho-cultural effects as significant as the more obvious effects of content.  For example, McLuhan argued that the sheer experience of reading and writing was one of the conditions that shaped modern individualism because it helped people create an “inner space” for ongoing conversation with themselves. Hence the importance of literacy for Bible reading Protestants whose personal relationship to God defined the Reformation. Is it a coincidence that journals and diaries flourished during the same period?The second semester will be devoted to student research projects on contemporary media. Topics might include the use of applications like texting and Facebook—do they simply make public what used to be private, or do they also constitute a buffer zone between us?  How have films like The Matrix and Avatar, on the one hand, and reality shows like American Idol and Jersey Shore, on the other, influenced the way we conceive of “reality” in the first place?  People between the ages of 8 and 18 spend more time in front of screens of some kind than any other activity—except sleeping.  Does that mean they are avoiding reality? Or does it mean that “reality” has changed?  How will that last question look when technologies that link our brains directly to computers become generally available?For 11th and 12th graders (and 10th graders with permission of instructor)\tT. deZengotitaThursdays from 3:30-5:30PM ", "gradesOffered": "12", "courseName": "Media Theory and Practice", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 897, "model": "registrationApp.course", "fields": {"courseCredit": "Full Year Course, 1 credit (open to 11th and 12th Grade Students)\tR. Meredith", "courseDescription": "This course introduces students to the fundamental theories, methods, movements, and artists who have shaped art history from the ancient to the contemporary.  This class incorporates weekly trips to museumsand galleries in order to view first hand the rich collections and special exhibitions that make New YorkCity one of the world’s foremost cultural centers.   Students are asked to be open and receptive to the range of artistic expression while learning to develop their investigative, analytical and interpretive skills. Projects include writing short research papers and art reviews, as well as creating audio podcasts and maintaining a class blog.", "gradesOffered": "12", "courseName": "Art in the City", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 902, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "Students who were athletes two of the three seasons in the previous year and who plan to continue being a2/3 H.S. sport athlete for the upcoming year qualify for this course. This does not include managers.Department Chair approval is needed to register. (See guideline #3 for further information.) Fall/Spring semesters, 0.125 credits per semester, approval required", "gradesOffered": "9,10,11,12", "courseName": "Physical Education", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 924, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "The student will learn the basic skills of First Aid and Cardiopulmonary Resuscitation (CPR).  Upon successful completion of the course, the student will have obtained certification in First Aid and CPR by the American Red Cross.Fall/Spring semesters, 0.125 credits per semester, approval required", "gradesOffered": "9,10,11,12", "courseName": "First Aid/CPR", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 926, "model": "registrationApp.course", "fields": {"courseCredit": "", "courseDescription": "For students who participate in a formal competitive sport outside of Dalton.  Progress reports must be turned in every three weeks from outside coach to PE Department Chair.  Students must attend practicesat least three times a week for 1-2 hours and must compete with players outside of the organization atleast three times a semester in organized and sanctioned events.  If it is a sport Dalton offers, the student must either participate on Daltons team or return to a regular PE class during the Dalton season.  Students will receive a contract, which must be signed by student and parent.Department Chair and High School Director approval is needed.Fall/Spring semesters, 0.125 credits per semester, approval required", "gradesOffered": "9,10,11,12", "courseName": "PE Outside", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 938, "model": "registrationApp.course", "fields": {"courseCredit": "Fall/Spring Semesters Course, 0.125 credits", "courseDescription": "(Including cardiovascular fitness, aerobics, weight training, etc.)", "gradesOffered": "9,10,11,12", "courseName": "Physical Fitness (Weight Training)", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 940, "model": "registrationApp.course", "fields": {"courseCredit": "Fall/Spring Semesters Course, 0.125 credits", "courseDescription": "", "gradesOffered": "9,10,11,12", "courseName": "Physical Fitness/Games", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 944, "model": "registrationApp.course", "fields": {"courseCredit": "Fall/Spring Semesters Course, 0.125 credits", "courseDescription": "PE 945 Managing/Coaching or Athletic Contest ManagementThis course is designed for those students interested in assisting Middle School or High School athletic teams. Students will be required to attend a minimum of two practices or games each week throughout theentire semester. Responsibilities may include operating the scoreboard, keeping the scorebook, videotaping, line judging, acting as statistician. To register, students are required to have the permission of the Physical Education Department Chair.Must have departmental approval.  Limited enrollment. ", "gradesOffered": "9,10,11,12", "courseName": "Ultimate Frisbee", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 947, "model": "registrationApp.course", "fields": {"courseCredit": "Fall/Spring Semesters Course, 0.125 credits", "courseDescription": "This course is for those students interested in assisting a PE class, grade K-5. PE for grades K-2 is at theFirst Program; PE for grades 3-5 is at 87th Street. All students must attend two classes each week, and times will be determined by labs. Students will be expected to participate, as well as assist students and teachers in the PE classes. To register, you must have the permission of the Physical Education Department Chair.", "gradesOffered": "9,10,11,12", "courseName": "Assisting in PE Classes", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 948, "model": "registrationApp.course", "fields": {"courseCredit": "Fall/Spring Semesters Course, 0.125 credits", "courseDescription": "The Team Handball class will play a modified version of Olympic Team Handball called \"Tag Handball\". The play is fast paced and features high-speed shots on goal.  The basic set up and concept is similar tosoccer except the ball is thrown instead of kicked. The player with the ball can run unrestricted with the ability to pass or shoot until he/she is tagged, at which point they have only a few seconds to pass the balland can no longer score.", "gradesOffered": "9,10,11,12", "courseName": "Team Handball", "preapprovalRequired": false, "rankType": null, "corequisite": "", "prerequisite": ""}}, {"pk": 1, "model": "registrationApp.coursediscipline", "fields": {"courseID": 3, "discipline": 4}}, {"pk": 2, "model": "registrationApp.coursediscipline", "fields": {"courseID": 6, "discipline": 4}}, {"pk": 3, "model": "registrationApp.coursediscipline", "fields": {"courseID": 8, "discipline": 4}}, {"pk": 4, "model": "registrationApp.coursediscipline", "fields": {"courseID": 9, "discipline": 4}}, {"pk": 5, "model": "registrationApp.coursediscipline", "fields": {"courseID": 11, "discipline": 4}}, {"pk": 6, "model": "registrationApp.coursediscipline", "fields": {"courseID": 16, "discipline": 4}}, {"pk": 7, "model": "registrationApp.coursediscipline", "fields": {"courseID": 18, "discipline": 4}}, {"pk": 8, "model": "registrationApp.coursediscipline", "fields": {"courseID": 20, "discipline": 4}}, {"pk": 9, "model": "registrationApp.coursediscipline", "fields": {"courseID": 50, "discipline": 4}}, {"pk": 10, "model": "registrationApp.coursediscipline", "fields": {"courseID": 51, "discipline": 4}}, {"pk": 11, "model": "registrationApp.coursediscipline", "fields": {"courseID": 52, "discipline": 4}}, {"pk": 12, "model": "registrationApp.coursediscipline", "fields": {"courseID": 55, "discipline": 6}}, {"pk": 13, "model": "registrationApp.coursediscipline", "fields": {"courseID": 57, "discipline": 6}}, {"pk": 14, "model": "registrationApp.coursediscipline", "fields": {"courseID": 67, "discipline": 4}}, {"pk": 15, "model": "registrationApp.coursediscipline", "fields": {"courseID": 68, "discipline": 4}}, {"pk": 16, "model": "registrationApp.coursediscipline", "fields": {"courseID": 71, "discipline": 4}}, {"pk": 17, "model": "registrationApp.coursediscipline", "fields": {"courseID": 74, "discipline": 6}}, {"pk": 18, "model": "registrationApp.coursediscipline", "fields": {"courseID": 76, "discipline": 6}}, {"pk": 19, "model": "registrationApp.coursediscipline", "fields": {"courseID": 80, "discipline": 6}}, {"pk": 20, "model": "registrationApp.coursediscipline", "fields": {"courseID": 82, "discipline": 6}}, {"pk": 21, "model": "registrationApp.coursediscipline", "fields": {"courseID": 90, "discipline": 4}}, {"pk": 22, "model": "registrationApp.coursediscipline", "fields": {"courseID": 91, "discipline": 4}}, {"pk": 23, "model": "registrationApp.coursediscipline", "fields": {"courseID": 109, "discipline": 3}}, {"pk": 24, "model": "registrationApp.coursediscipline", "fields": {"courseID": 111, "discipline": 3}}, {"pk": 25, "model": "registrationApp.coursediscipline", "fields": {"courseID": 112, "discipline": 3}}, {"pk": 26, "model": "registrationApp.coursediscipline", "fields": {"courseID": 117, "discipline": 3}}, {"pk": 27, "model": "registrationApp.coursediscipline", "fields": {"courseID": 118, "discipline": 3}}, {"pk": 28, "model": "registrationApp.coursediscipline", "fields": {"courseID": 127, "discipline": 3}}, {"pk": 29, "model": "registrationApp.coursediscipline", "fields": {"courseID": 134, "discipline": 3}}, {"pk": 30, "model": "registrationApp.coursediscipline", "fields": {"courseID": 139, "discipline": 3}}, {"pk": 31, "model": "registrationApp.coursediscipline", "fields": {"courseID": 141, "discipline": 3}}, {"pk": 32, "model": "registrationApp.coursediscipline", "fields": {"courseID": 144, "discipline": 3}}, {"pk": 33, "model": "registrationApp.coursediscipline", "fields": {"courseID": 147, "discipline": 3}}, {"pk": 34, "model": "registrationApp.coursediscipline", "fields": {"courseID": 153, "discipline": 3}}, {"pk": 35, "model": "registrationApp.coursediscipline", "fields": {"courseID": 154, "discipline": 3}}, {"pk": 36, "model": "registrationApp.coursediscipline", "fields": {"courseID": 162, "discipline": 3}}, {"pk": 37, "model": "registrationApp.coursediscipline", "fields": {"courseID": 167, "discipline": 3}}, {"pk": 38, "model": "registrationApp.coursediscipline", "fields": {"courseID": 172, "discipline": 3}}, {"pk": 39, "model": "registrationApp.coursediscipline", "fields": {"courseID": 173, "discipline": 3}}, {"pk": 40, "model": "registrationApp.coursediscipline", "fields": {"courseID": 182, "discipline": 3}}, {"pk": 41, "model": "registrationApp.coursediscipline", "fields": {"courseID": 187, "discipline": 3}}, {"pk": 42, "model": "registrationApp.coursediscipline", "fields": {"courseID": 189, "discipline": 3}}, {"pk": 43, "model": "registrationApp.coursediscipline", "fields": {"courseID": 190, "discipline": 3}}, {"pk": 44, "model": "registrationApp.coursediscipline", "fields": {"courseID": 191, "discipline": 3}}, {"pk": 45, "model": "registrationApp.coursediscipline", "fields": {"courseID": 202, "discipline": 3}}, {"pk": 46, "model": "registrationApp.coursediscipline", "fields": {"courseID": 205, "discipline": 3}}, {"pk": 47, "model": "registrationApp.coursediscipline", "fields": {"courseID": 206, "discipline": 3}}, {"pk": 48, "model": "registrationApp.coursediscipline", "fields": {"courseID": 208, "discipline": 3}}, {"pk": 49, "model": "registrationApp.coursediscipline", "fields": {"courseID": 209, "discipline": 3}}, {"pk": 50, "model": "registrationApp.coursediscipline", "fields": {"courseID": 219, "discipline": 3}}, {"pk": 51, "model": "registrationApp.coursediscipline", "fields": {"courseID": 222, "discipline": 3}}, {"pk": 52, "model": "registrationApp.coursediscipline", "fields": {"courseID": 233, "discipline": 3}}, {"pk": 53, "model": "registrationApp.coursediscipline", "fields": {"courseID": 235, "discipline": 3}}, {"pk": 54, "model": "registrationApp.coursediscipline", "fields": {"courseID": 256, "discipline": 3}}, {"pk": 55, "model": "registrationApp.coursediscipline", "fields": {"courseID": 260, "discipline": 3}}, {"pk": 56, "model": "registrationApp.coursediscipline", "fields": {"courseID": 270, "discipline": 3}}, {"pk": 57, "model": "registrationApp.coursediscipline", "fields": {"courseID": 302, "discipline": 1}}, {"pk": 58, "model": "registrationApp.coursediscipline", "fields": {"courseID": 303, "discipline": 1}}, {"pk": 59, "model": "registrationApp.coursediscipline", "fields": {"courseID": 305, "discipline": 1}}, {"pk": 60, "model": "registrationApp.coursediscipline", "fields": {"courseID": 306, "discipline": 1}}, {"pk": 61, "model": "registrationApp.coursediscipline", "fields": {"courseID": 307, "discipline": 1}}, {"pk": 62, "model": "registrationApp.coursediscipline", "fields": {"courseID": 308, "discipline": 1}}, {"pk": 63, "model": "registrationApp.coursediscipline", "fields": {"courseID": 310, "discipline": 1}}, {"pk": 64, "model": "registrationApp.coursediscipline", "fields": {"courseID": 311, "discipline": 1}}, {"pk": 65, "model": "registrationApp.coursediscipline", "fields": {"courseID": 312, "discipline": 1}}, {"pk": 66, "model": "registrationApp.coursediscipline", "fields": {"courseID": 319, "discipline": 1}}, {"pk": 67, "model": "registrationApp.coursediscipline", "fields": {"courseID": 331, "discipline": 1}}, {"pk": 68, "model": "registrationApp.coursediscipline", "fields": {"courseID": 332, "discipline": 1}}, {"pk": 69, "model": "registrationApp.coursediscipline", "fields": {"courseID": 339, "discipline": 1}}, {"pk": 70, "model": "registrationApp.coursediscipline", "fields": {"courseID": 347, "discipline": 1}}, {"pk": 71, "model": "registrationApp.coursediscipline", "fields": {"courseID": 350, "discipline": 1}}, {"pk": 72, "model": "registrationApp.coursediscipline", "fields": {"courseID": 407, "discipline": 2}}, {"pk": 73, "model": "registrationApp.coursediscipline", "fields": {"courseID": 414, "discipline": 2}}, {"pk": 74, "model": "registrationApp.coursediscipline", "fields": {"courseID": 428, "discipline": 2}}, {"pk": 75, "model": "registrationApp.coursediscipline", "fields": {"courseID": 437, "discipline": 2}}, {"pk": 76, "model": "registrationApp.coursediscipline", "fields": {"courseID": 438, "discipline": 2}}, {"pk": 77, "model": "registrationApp.coursediscipline", "fields": {"courseID": 446, "discipline": 2}}, {"pk": 78, "model": "registrationApp.coursediscipline", "fields": {"courseID": 458, "discipline": 2}}, {"pk": 79, "model": "registrationApp.coursediscipline", "fields": {"courseID": 459, "discipline": 2}}, {"pk": 80, "model": "registrationApp.coursediscipline", "fields": {"courseID": 464, "discipline": 2}}, {"pk": 81, "model": "registrationApp.coursediscipline", "fields": {"courseID": 471, "discipline": 2}}, {"pk": 82, "model": "registrationApp.coursediscipline", "fields": {"courseID": 512, "discipline": 5}}, {"pk": 83, "model": "registrationApp.coursediscipline", "fields": {"courseID": 532, "discipline": 5}}, {"pk": 84, "model": "registrationApp.coursediscipline", "fields": {"courseID": 540, "discipline": 5}}, {"pk": 85, "model": "registrationApp.coursediscipline", "fields": {"courseID": 547, "discipline": 5}}, {"pk": 86, "model": "registrationApp.coursediscipline", "fields": {"courseID": 558, "discipline": 5}}, {"pk": 87, "model": "registrationApp.coursediscipline", "fields": {"courseID": 561, "discipline": 5}}, {"pk": 88, "model": "registrationApp.coursediscipline", "fields": {"courseID": 562, "discipline": 5}}, {"pk": 89, "model": "registrationApp.coursediscipline", "fields": {"courseID": 579, "discipline": 5}}, {"pk": 90, "model": "registrationApp.coursediscipline", "fields": {"courseID": 596, "discipline": 5}}, {"pk": 91, "model": "registrationApp.coursediscipline", "fields": {"courseID": 621, "discipline": 2}}, {"pk": 92, "model": "registrationApp.coursediscipline", "fields": {"courseID": 623, "discipline": 2}}, {"pk": 93, "model": "registrationApp.coursediscipline", "fields": {"courseID": 625, "discipline": 2}}, {"pk": 94, "model": "registrationApp.coursediscipline", "fields": {"courseID": 626, "discipline": 2}}, {"pk": 95, "model": "registrationApp.coursediscipline", "fields": {"courseID": 629, "discipline": 2}}, {"pk": 96, "model": "registrationApp.coursediscipline", "fields": {"courseID": 701, "discipline": 10}}, {"pk": 97, "model": "registrationApp.coursediscipline", "fields": {"courseID": 704, "discipline": 10}}, {"pk": 98, "model": "registrationApp.coursediscipline", "fields": {"courseID": 705, "discipline": 10}}, {"pk": 99, "model": "registrationApp.coursediscipline", "fields": {"courseID": 706, "discipline": 10}}, {"pk": 100, "model": "registrationApp.coursediscipline", "fields": {"courseID": 707, "discipline": 10}}, {"pk": 101, "model": "registrationApp.coursediscipline", "fields": {"courseID": 708, "discipline": 10}}, {"pk": 102, "model": "registrationApp.coursediscipline", "fields": {"courseID": 709, "discipline": 10}}, {"pk": 103, "model": "registrationApp.coursediscipline", "fields": {"courseID": 710, "discipline": 10}}, {"pk": 104, "model": "registrationApp.coursediscipline", "fields": {"courseID": 711, "discipline": 10}}, {"pk": 105, "model": "registrationApp.coursediscipline", "fields": {"courseID": 712, "discipline": 10}}, {"pk": 106, "model": "registrationApp.coursediscipline", "fields": {"courseID": 714, "discipline": 10}}, {"pk": 107, "model": "registrationApp.coursediscipline", "fields": {"courseID": 716, "discipline": 10}}, {"pk": 108, "model": "registrationApp.coursediscipline", "fields": {"courseID": 717, "discipline": 10}}, {"pk": 109, "model": "registrationApp.coursediscipline", "fields": {"courseID": 718, "discipline": 10}}, {"pk": 110, "model": "registrationApp.coursediscipline", "fields": {"courseID": 722, "discipline": 10}}, {"pk": 111, "model": "registrationApp.coursediscipline", "fields": {"courseID": 723, "discipline": 10}}, {"pk": 112, "model": "registrationApp.coursediscipline", "fields": {"courseID": 724, "discipline": 10}}, {"pk": 113, "model": "registrationApp.coursediscipline", "fields": {"courseID": 725, "discipline": 9}}, {"pk": 114, "model": "registrationApp.coursediscipline", "fields": {"courseID": 727, "discipline": 9}}, {"pk": 115, "model": "registrationApp.coursediscipline", "fields": {"courseID": 730, "discipline": 8}}, {"pk": 116, "model": "registrationApp.coursediscipline", "fields": {"courseID": 731, "discipline": 8}}, {"pk": 117, "model": "registrationApp.coursediscipline", "fields": {"courseID": 732, "discipline": 8}}, {"pk": 118, "model": "registrationApp.coursediscipline", "fields": {"courseID": 733, "discipline": 8}}, {"pk": 119, "model": "registrationApp.coursediscipline", "fields": {"courseID": 734, "discipline": 8}}, {"pk": 120, "model": "registrationApp.coursediscipline", "fields": {"courseID": 736, "discipline": 9}}, {"pk": 121, "model": "registrationApp.coursediscipline", "fields": {"courseID": 740, "discipline": 10}}, {"pk": 122, "model": "registrationApp.coursediscipline", "fields": {"courseID": 742, "discipline": 8}}, {"pk": 123, "model": "registrationApp.coursediscipline", "fields": {"courseID": 744, "discipline": 8}}, {"pk": 124, "model": "registrationApp.coursediscipline", "fields": {"courseID": 748, "discipline": 8}}, {"pk": 125, "model": "registrationApp.coursediscipline", "fields": {"courseID": 752, "discipline": 10}}, {"pk": 126, "model": "registrationApp.coursediscipline", "fields": {"courseID": 753, "discipline": 10}}, {"pk": 127, "model": "registrationApp.coursediscipline", "fields": {"courseID": 754, "discipline": 10}}, {"pk": 128, "model": "registrationApp.coursediscipline", "fields": {"courseID": 755, "discipline": 10}}, {"pk": 129, "model": "registrationApp.coursediscipline", "fields": {"courseID": 761, "discipline": 9}}, {"pk": 130, "model": "registrationApp.coursediscipline", "fields": {"courseID": 776, "discipline": 9}}, {"pk": 131, "model": "registrationApp.coursediscipline", "fields": {"courseID": 788, "discipline": 8}}, {"pk": 132, "model": "registrationApp.coursediscipline", "fields": {"courseID": 791, "discipline": 10}}, {"pk": 133, "model": "registrationApp.coursediscipline", "fields": {"courseID": 807, "discipline": 11}}, {"pk": 134, "model": "registrationApp.coursediscipline", "fields": {"courseID": 850, "discipline": 2}}, {"pk": 135, "model": "registrationApp.coursediscipline", "fields": {"courseID": 861, "discipline": 11}}, {"pk": 136, "model": "registrationApp.coursediscipline", "fields": {"courseID": 862, "discipline": 11}}, {"pk": 137, "model": "registrationApp.coursediscipline", "fields": {"courseID": 883, "discipline": 5}}, {"pk": 138, "model": "registrationApp.coursediscipline", "fields": {"courseID": 893, "discipline": 5}}, {"pk": 139, "model": "registrationApp.coursediscipline", "fields": {"courseID": 894, "discipline": 3}}, {"pk": 140, "model": "registrationApp.coursediscipline", "fields": {"courseID": 894, "discipline": 5}}, {"pk": 141, "model": "registrationApp.coursediscipline", "fields": {"courseID": 895, "discipline": 5}}, {"pk": 142, "model": "registrationApp.coursediscipline", "fields": {"courseID": 897, "discipline": 5}}, {"pk": 143, "model": "registrationApp.coursediscipline", "fields": {"courseID": 897, "discipline": 10}}, {"pk": 144, "model": "registrationApp.coursediscipline", "fields": {"courseID": 902, "discipline": 7}}, {"pk": 145, "model": "registrationApp.coursediscipline", "fields": {"courseID": 924, "discipline": 7}}, {"pk": 146, "model": "registrationApp.coursediscipline", "fields": {"courseID": 926, "discipline": 7}}, {"pk": 147, "model": "registrationApp.coursediscipline", "fields": {"courseID": 938, "discipline": 7}}, {"pk": 148, "model": "registrationApp.coursediscipline", "fields": {"courseID": 940, "discipline": 7}}, {"pk": 149, "model": "registrationApp.coursediscipline", "fields": {"courseID": 944, "discipline": 7}}, {"pk": 150, "model": "registrationApp.coursediscipline", "fields": {"courseID": 947, "discipline": 7}}, {"pk": 151, "model": "registrationApp.coursediscipline", "fields": {"courseID": 948, "discipline": 7}}, {"pk": 1, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 57, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 2, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 57, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 3, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 55, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 4, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 55, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 5, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 74, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 6, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 76, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 7, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 76, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 8, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 82, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 9, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 80, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 10, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 80, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 11, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,4", "courseID": 742, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 12, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "2,5,6,7,8", "FPeriodDays": "", "courseID": 748, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 13, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "3,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 748, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 14, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 730, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,4", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 15, "model": "registrationApp.section", "fields": {"APeriodDays": "2,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 744, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 16, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "2,5,6,7,8", "FPeriodDays": "", "courseID": 732, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "2,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 17, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "2,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 733, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 18, "model": "registrationApp.section", "fields": {"APeriodDays": "1,4", "CPeriodDays": "", "BPeriodDays": "1,4", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 731, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 19, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "2,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "2,5,6,7,8", "courseID": 734, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 20, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,4", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,4", "courseID": 788, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 21, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,4", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 850, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 22, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 850, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "1,3", "ZPeriodDays": ""}}, {"pk": 23, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,4", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 850, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 24, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 850, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,3", "ZPeriodDays": ""}}, {"pk": 25, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 437, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 26, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 437, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 27, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 437, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 28, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 437, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 29, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 437, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 30, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 437, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 31, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 437, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 32, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 437, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 33, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 623, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 34, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 625, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 35, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 626, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 36, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 629, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 37, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 407, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 38, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 414, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 39, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 438, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 40, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 446, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 41, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 459, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 42, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 464, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 43, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 471, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 44, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 428, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 45, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 458, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 46, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 621, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 47, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 512, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 48, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 512, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 49, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 512, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 50, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 512, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 51, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 512, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 52, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 512, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 53, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 512, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 54, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 512, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 55, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 894, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": "2"}}, {"pk": 56, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 532, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 57, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 532, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 58, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 532, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 59, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 532, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 60, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 532, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 61, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 532, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 62, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 532, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 63, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 540, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 64, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 561, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 65, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 562, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 66, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 883, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 67, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 547, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 68, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 558, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 69, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 579, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 70, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 596, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 71, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 893, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": "4"}}, {"pk": 72, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 893, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": "4"}}, {"pk": 73, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 895, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": "4"}}, {"pk": 74, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,3", "FPeriodDays": "", "courseID": 897, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,3", "ZPeriodDays": ""}}, {"pk": 75, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 893, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": "4"}}, {"pk": 76, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 893, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": "4"}}, {"pk": 77, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 895, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": "4"}}, {"pk": 78, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,3", "FPeriodDays": "", "courseID": 897, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,3", "ZPeriodDays": ""}}, {"pk": 79, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 134, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 80, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 202, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 81, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 209, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 82, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 187, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 83, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 153, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 84, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 127, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 85, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 127, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 86, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 222, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 87, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 208, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 88, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 208, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 89, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 189, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 90, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 147, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 91, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 147, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 92, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 117, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 93, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 117, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 94, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 118, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 95, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 118, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 96, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 219, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 97, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 190, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 98, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 144, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 99, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 144, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 100, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 144, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 101, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 111, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 102, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 112, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 103, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 112, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 104, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 233, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 105, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 206, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 106, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 191, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 107, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 141, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 108, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 141, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 109, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 141, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 110, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 109, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 111, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 256, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 112, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 205, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 113, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 139, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 114, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 139, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 115, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 139, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 116, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 270, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 117, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 162, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 118, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 167, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 119, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 235, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 120, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 260, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 121, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 182, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 122, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 154, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 123, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 172, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 124, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 173, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 125, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 894, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": "2"}}, {"pk": 126, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 894, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": "2"}}, {"pk": 127, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "2,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 91, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 128, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,4", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 90, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 129, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 8, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 130, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 9, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 131, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 9, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 132, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 9, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 133, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 9, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 134, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 9, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "2,3,4,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 135, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 9, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 136, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 11, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 137, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 11, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 138, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 16, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 139, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 16, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 140, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 18, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 141, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 18, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 142, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 18, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 143, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 18, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 144, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 18, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 145, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 18, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 146, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 20, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 147, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 50, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 148, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 50, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 149, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 51, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 150, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 51, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 151, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 52, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 152, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 52, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 153, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 52, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 154, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 52, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 155, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 67, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 156, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 67, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "1,2,3,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 157, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 68, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 158, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 68, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,3,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 159, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 3, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 160, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 3, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 161, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 6, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 162, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 6, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 163, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 6, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 164, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 71, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 165, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 807, "semesterOne": true, "KPeriodDays": "4", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 166, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,4", "GPeriodDays": "", "FPeriodDays": "", "courseID": 862, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 167, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "3,5,6,7,8", "courseID": 862, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 168, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 861, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 169, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 861, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 170, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 725, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 171, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 776, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 172, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 727, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 173, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 736, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 174, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "3,5,6,7,8", "courseID": 761, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 175, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,4", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 924, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 176, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,4", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 177, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,4", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 178, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 179, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 180, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "1,4", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 181, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "1,4", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 182, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "2,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 183, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "2,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 184, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": true, "KPeriodDays": "1,4", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 185, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": true, "KPeriodDays": "1,4", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 186, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 940, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "2,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 187, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 944, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 188, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 947, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 189, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,4", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 948, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 190, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 948, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "1,4", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 191, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,4", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 192, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,4", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 193, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 194, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 195, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,4", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 196, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,4", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 197, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "2,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 198, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "2,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 199, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": false, "KPeriodDays": "1,4", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 200, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 938, "semesterOne": false, "KPeriodDays": "1,4", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 201, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 940, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "2,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 202, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 944, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 203, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 947, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 204, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,4", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 948, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 205, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 948, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,4", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 206, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 902, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 207, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 926, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 208, "model": "registrationApp.section", "fields": {"APeriodDays": "4", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 307, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 209, "model": "registrationApp.section", "fields": {"APeriodDays": "4", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 332, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 210, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "1", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 307, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 211, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "1", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 308, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 212, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "4", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 306, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 213, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "4", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 308, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 214, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "4", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2,3,4,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 312, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 215, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2", "GPeriodDays": "", "FPeriodDays": "", "courseID": 307, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 216, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "2,3,4,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "2", "GPeriodDays": "", "FPeriodDays": "", "courseID": 308, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 217, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "4", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 332, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 218, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1", "courseID": 307, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 219, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1", "courseID": 308, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 220, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "3", "courseID": 305, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 221, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "3", "courseID": 331, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 222, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "2", "FPeriodDays": "", "courseID": 306, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 223, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "3", "FPeriodDays": "", "courseID": 308, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 224, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 319, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "2", "ZPeriodDays": ""}}, {"pk": 225, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 307, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "3", "ZPeriodDays": ""}}, {"pk": 226, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 312, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 227, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 302, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 228, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 310, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 229, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 350, "semesterOne": true, "KPeriodDays": "", "semesterTwo": false, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 230, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 303, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 231, "model": "registrationApp.section", "fields": {"APeriodDays": "2,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 311, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 232, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 347, "semesterOne": false, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 233, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "1,2,4,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 339, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 234, "model": "registrationApp.section", "fields": {"APeriodDays": "1,2,4,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 717, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 235, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 717, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 236, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 717, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 237, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "2,5,6,7,8", "FPeriodDays": "", "courseID": 718, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "2,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 238, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 722, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 239, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 722, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 240, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 722, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 241, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 723, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,2,3,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 242, "model": "registrationApp.section", "fields": {"APeriodDays": "1,4", "CPeriodDays": "", "BPeriodDays": "1,4", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 724, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 243, "model": "registrationApp.section", "fields": {"APeriodDays": "2,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "2,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 740, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 244, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 791, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 245, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "2,5,6,7,8", "FPeriodDays": "", "courseID": 701, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "2,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 246, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,3,4,5,6,7,8", "courseID": 706, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 247, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 706, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "1,2,4,5,6,7,8", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 248, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,4", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,4", "courseID": 707, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 249, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,4", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,4", "courseID": 711, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 250, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,4", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,4", "courseID": 711, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 251, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,3", "FPeriodDays": "", "courseID": 711, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,3", "ZPeriodDays": ""}}, {"pk": 252, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,3", "FPeriodDays": "", "courseID": 711, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,3", "ZPeriodDays": ""}}, {"pk": 253, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "2,5,6,7,8", "FPeriodDays": "", "courseID": 714, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "2,5,6,7,8", "ZPeriodDays": ""}}, {"pk": 254, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "3,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "3,5,6,7,8", "courseID": 714, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 255, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "3,5,6,7,8", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "3,5,6,7,8", "GPeriodDays": "", "FPeriodDays": "", "courseID": 752, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 256, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "3,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "3,5,6,7,8", "courseID": 753, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 257, "model": "registrationApp.section", "fields": {"APeriodDays": "2,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "2,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 754, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 258, "model": "registrationApp.section", "fields": {"APeriodDays": "2,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "2,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 754, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 259, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "3,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "3,5,6,7,8", "courseID": 755, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 260, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,4", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,4", "courseID": 704, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 261, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,3", "FPeriodDays": "", "courseID": 705, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,3", "ZPeriodDays": ""}}, {"pk": 262, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,3", "FPeriodDays": "", "courseID": 705, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,3", "ZPeriodDays": ""}}, {"pk": 263, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,2,3,5,6,7,8", "FPeriodDays": "", "courseID": 708, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 264, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,3,4,5,6,7,8", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 708, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 265, "model": "registrationApp.section", "fields": {"APeriodDays": "2,5,6,7,8", "CPeriodDays": "", "BPeriodDays": "2,5,6,7,8", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 709, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 266, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "1,4", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "1,4", "courseID": 710, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 267, "model": "registrationApp.section", "fields": {"APeriodDays": "1,4", "CPeriodDays": "", "BPeriodDays": "1,4", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "", "FPeriodDays": "", "courseID": 712, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "", "ZPeriodDays": ""}}, {"pk": 268, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,3", "FPeriodDays": "", "courseID": 716, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,3", "ZPeriodDays": ""}}, {"pk": 269, "model": "registrationApp.section", "fields": {"APeriodDays": "", "CPeriodDays": "", "BPeriodDays": "", "EPeriodDays": "", "DPeriodDays": "", "GPeriodDays": "1,3", "FPeriodDays": "", "courseID": 897, "semesterOne": true, "KPeriodDays": "", "semesterTwo": true, "IPeriodDays": "", "HPeriodDays": "1,3", "ZPeriodDays": ""}}, {"pk": 1, "model": "registrationApp.studentschedule", "fields": {"studentID": 14, "rank": 1, "sectionID": 224}}, {"pk": 2, "model": "registrationApp.studentschedule", "fields": {"studentID": 14, "rank": 1, "sectionID": 2}}, {"pk": 3, "model": "registrationApp.studentschedule", "fields": {"studentID": 14, "rank": 1, "sectionID": 95}}, {"pk": 4, "model": "registrationApp.studentschedule", "fields": {"studentID": 14, "rank": 1, "sectionID": 67}}, {"pk": 5, "model": "registrationApp.studentschedule", "fields": {"studentID": 14, "rank": 1, "sectionID": 43}}, {"pk": 1, "model": "registrationApp.preapproval", "fields": {"courseID": 305, "studentID": 14}}, {"pk": 2, "model": "registrationApp.preapproval", "fields": {"courseID": 319, "studentID": 14}}]